const t={map:'[{"br":["0.0"],"info":["1.0"],"元素的水平垂直居中":["2.0"],"定位":["2.1","2.2","2.3"],"flex弹性布局":["2.4"],"grid网格布局":["2.5"],"table布局":["2.6"],"总结":["2.7"],"元素居中布局":["2.8"],"块级元素居中布局":["2.9"],"flex布局":["3.0"],"什么是flex布局":["3.1"],"属性":["3.2"],"容器属性":["3.3"],"flex":["3.4","3.5","3.6","3.12","3.13","3.14","3.15"],"justify":["3.7"],"align":["3.8","3.9","3.16"],"容器成员属性":["3.10"],"order":["3.11"],"应用场景":["3.17"],"tip":["4.0","8.0"],"html4":["6.0"]},{"0":["2.9"],"1":["6.1","6.2","6.3","6.4","6.5"],"2":["6.3","6.6"],"3":["6.7"],"4":["6.8"],"5":["6.9","6.17"],"6":["6.10"],"7":["6.11"],"8":["6.12","6.13","6.14","6.15","6.16","6.17"],"9":["6.18"],"10":["6.19"],"11":["6.20"],"我的知识库搭建过程":["1.0"],"margin":["2.1","2.2","2.9"],"auto":["2.1"],"html":["2.1","2.2","2.3","2.4","2.5","2.6","6.3"],"title":["2.1","2.2","2.3","2.4","2.5","2.6"],"负值":["2.2"],"body":["2.2","2.3","2.4","2.5","2.6"],"div":["2.2","2.3","2.4","2.6"],"class":["2.2","2.6"],"transform":["2.3"],"上述方法中":["2.7"],"水平居中":["2.8","2.9"],"行内元素可设置":["2.8"],"text":["2.8"],"定宽":["2.9"],"flexible":["3.1"],"box":["3.1"],"简称":["3.1"],"flex":["3.1"],"flex常见的属性可分为两种":["3.2"],"direction":["3.4"],"决定":["3.4"],"wrap":["3.5"],"flow":["3.6"],"content":["3.7","3.9"],"决定了项目在主轴上的对齐方式":["3.7"],"items":["3.8"],"决定了项目在交叉轴上的对齐方式":["3.8"],"决定了多条轴线的对齐方式":["3.9"],"如果项目只有一条轴线":["3.9"],"定义项目的排列顺序":["3.11"],"grow":["3.12","3.15"],"定义项目的放大比例":["3.12"],"容器宽度":["3.12","3.13"],"shrink":["3.13","3.15"],"定义了项目的缩小比例":["3.13"],"元素总宽度时如何收缩":["3.13"],"basis":["3.14","3.15"],"设置的是元素在主轴上的初始尺寸":["3.14"],"初始尺寸":["3.14"],"是元素在":["3.14"],"属性是":["3.15"],"和":["3.15"],"的简写":["3.15"],"self":["3.16"],"允许单个项目有与其他项目不一样的对齐方式":["3.16"],"可以覆盖":["3.16"],"元素水平垂直居中":["3.17"],"提示":["4.0"],"warning":["6.0"],"html元素":["6.6"],"html属性":["6.7"],"tip":["6.7","6.17"],"属性":["6.7"],"是为元素提供附属信息的":["6.7"],"标题标签":["6.8"],"h1":["6.8"],"h6":["6.8"],"info":["6.8","6.10","6.11"],"分类":["6.8","6.10"],"它属于排版标签":["6.8"],"段落标签":["6.9"],"链接标签":["6.10"],"a":["6.10"],"它属于链接标签":["6.10"],"图像标签":["6.11"],"img":["6.11"],"html文档":["6.12"],"meta标签":["6.17"],"指引一下":["8.0"]},{"0":["3.12","3.15"],"1":["3.15","6.13"],"2":["6.14"],"3":["6.4","6.15"],"4":["6.5","6.16"],"50":["2.9"],"tip":["0.0","6.6","6.8","6.10","6.12"],"这里可以看到我的知识库搭建的过程":["1.0"],"body":["2.1"],"div":["2.1","2.5"],"class":["2.1","2.3","2.4","2.5"],"father":["2.1","2.2","2.3","2.4","2.5","2.6"],"son":["2.1","2.2","2.3","2.4","2.6"],"css":["2.2","3.13","3.15"],"不知道元素宽高大小仍能实现水平垂直居中的方法有":["2.7"],"利用定位":["2.7"],"align":["2.8"],"center":["2.8"],"flex布局设置父元素":["2.8"],"auto":["2.9","3.15"],"绝对定位":["2.9"],"left":["2.9"],"弹性布局":["3.1"],"可以简便":["3.1"],"完整":["3.1"],"响应式地实现各种页面布局":["3.1"],"容器属性":["3.2"],"主轴":["3.4"],"的方向":["3.4"],"就是项目的排列方向":["3.4"],"决定容器中的项目是否换行":["3.5"],"这是":["3.6"],"flex":["3.7","3.9"],"start":["3.7"],"那这个属性不起作用":["3.9"],"数值越小":["3.11"],"元素总宽度时如何伸展":["3.12"],"默认为":["3.12"],"默认为1":["3.13"],"即如果空间不足":["3.13"],"该项目将缩小":["3.13"],"grow":["3.14"],"和":["3.14"],"shrink":["3.14"],"生效前的尺寸":["3.14"],"默认值为":["3.15","3.16"],"也是比较难懂的一个复合属性":["3.15"],"item":["3.15"],"none":["3.15"],"items":["3.16"],"属性":["3.16"],"三栏两栏布局":["3.17"],"这是一些面试题":["4.0"],"开始之前你要明白":["6.0"],"什么是html":["6.1"],"定义":["6.2"],"的基本骨架":["6.3"],"doctype":["6.3"],"总结":["6.5"],"html标签":["6.7"],"是可以书写属性的":["6.7"],"但是属性是要写在开放标签上的":["6.7"],"属性的写法":["6.7"],"主要都是":["6.7"],"以":["6.7"],"双标签":["6.8","6.10"],"块级元素":["6.8"],"标题":["6.8"],"header":["6.8"],"有六种":["6.8"],"p":["6.9"],"info":["6.9"],"行内元素":["6.10"],"超链接":["6.10"],"链接":["6.10"],"使用标签":["6.10"],"分类":["6.11"],"它属于图像标签":["6.11"],"行内块元素":["6.11"],"单标签":["6.11"],"head标签":["6.12"],"title标签":["6.13"],"定义网页的元信息":["6.17"],"它不会显示在网页中":["6.17"],"但会被浏览器解析":["6.17"],"通常用于指定网页的描述":["6.17"],"关键词":["6.17"],"列表标签":["6.18"],"表格标签":["6.19"],"表单标签":["6.20"],"这是我学习前端的学习笔记":["8.0"]},{"你可以的":["0.0"],"不能盲目学习":["0.0"],"也要掌握技巧":["0.0"],"如果你也想要搭建一个属于你自己的知识库":["1.0"],"css":["2.1","2.3","2.4","2.5","2.6"],"position":["2.1","2.2","2.3","2.9"],"relative":["2.2","2.3"],"父元素相对定位":["2.2","2.3"],"width":["2.2"],"200px":["2.2"],"height":["2.2"],"border":["2.2"],"display":["2.4","2.6","2.8"],"flex":["2.4","2.8","3.8"],"justify":["2.4","2.8"],"son":["2.5"],"table":["2.6","6.19"],"cell":["2.6"],"vertical":["2.6"],"align":["2.6"],"middle":["2.6"],"margin":["2.7"],"auto":["2.7","3.14","3.16"],"负自身一半":["2.9"],"垂直居中":["2.9"],"absolute设置":["2.9"],"采用flex布局的元素":["3.1"],"称为":["3.1"],"容器":["3.1"],"container":["3.1"],"容器成员属性":["3.2"],"row":["3.4"],"nowrap":["3.5"],"direction":["3.6"],"与":["3.6"],"默认值":["3.7"],"左对齐":["3.7"],"start":["3.8","3.9"],"交叉轴的起点对齐":["3.8"],"与交叉轴的起点对齐":["3.9"],"end":["3.9"],"排列越靠前":["3.11"],"即如果存在剩余空间":["3.12"],"也不放大":["3.12"],"如果所有项目的":["3.12"],"item":["3.13"],"number":["3.13"],"浏览器根据这个属性":["3.14"],"计算主轴是否有多余空间":["3.14"],"默认值为":["3.14"],"即项目的本来大小":["3.14"],"表示继承父元素的":["3.16"],"移动端":["3.17"],"超文本标记语言":["6.2"],"head":["6.3","6.12"],"meta":["6.3","6.17"],"后缀名":["6.4"],"html":["6.5","6.8","6.12","6.17"],"不是一种编程语言":["6.5"],"指的是从":["6.6"],"开放标签":["6.6"],"到":["6.6"],"属性名":["6.7"],"属性值":["6.7"],"的形式书写":["6.7"],"有一些属性是所有":["6.7"],"分别有":["6.8"],"从定义上讲":["6.8"],"h1是最大的标题":["6.8"],"h6是最小的":["6.8"],"分类":["6.9"],"它属于排版标签":["6.9"],"双标签":["6.9"],"来设置超文本链接":["6.10"],"超链接可以是一个字":["6.10"],"一个词":["6.10"],"一张图":["6.10"],"点击它可以跳转到新的文档或者是当前文档的某个地方":["6.10"],"可以通过":["6.10"],"tip":["6.11","6.13","6.16"],"这个标签可以在页面上显示图片":["6.11"],"是空标签":["6.11"],"它包含了所有头部标签元素":["6.12"],"link标签":["6.14"],"style标签":["6.15"],"script标签":["6.16"],"文件的最后修改时间":["6.17"],"作者":["6.17"],"和其他元数据":["6.17"],"搜索引擎的关键词":["6.17"],"ul":["6.18"],"form":["6.20"]},{"1":["3.13"],"2":["3.15"],"8":["6.3"],"相信自己":["0.0"],"超越自己":["0.0"],"warning":["0.0"],"这里会有你的答案":["1.0"],"relative":["2.1"],"父元素相对定位":["2.1"],"width":["2.1","2.3","2.4","2.6","3.14"],"200px":["2.1","2.3","2.4","2.6"],"height":["2.1","2.3","2.6","3.14"],"border":["2.1","2.3"],"1px":["2.2","2.3"],"solid":["2.2","2.3"],"f40":["2.2"],"absolute":["2.2"],"子元素绝对定位":["2.2"],"top":["2.2","2.9"],"content":["2.4","2.8","6.17"],"center":["2.4","2.6","3.7","3.9"],"align":["2.4","2.5"],"items":["2.4","2.5"],"display":["2.5"],"grid":["2.5"],"text":["2.6"],"transform":["2.7"],"垂直居中":["2.8"],"它的所有子元素自动成为容器成员":["3.1"],"项目":["3.1"],"默认值":["3.4","3.5"],"主轴为水平方向":["3.4"],"起点在左侧":["3.4"],"不换行":["3.5"],"wrap":["3.6"],"end":["3.7","3.8"],"右对齐":["3.7"],"与交叉轴的终点对齐":["3.9"],"与交叉轴的中点对齐":["3.9"],"space":["3.9"],"默认为0":["3.11"],"属性都为1":["3.12"],"则它们将等分剩余空间":["3.12"],"default":["3.13"],"如果所有项目的":["3.13"],"如设置了":["3.14"],"则元素尺寸由":["3.14"],"如果没有父元素":["3.16"],"则等同于":["3.16"],"小程序都建议使用flex弹性布局":["3.17"],"是":["6.0"],"英语":["6.2"],"hypertext":["6.2"],"charset":["6.3"],"utf":["6.3"],"html":["6.4","6.10","6.11"],"而是一种":["6.5"],"标记语言":["6.5"],"结束标签":["6.6"],"的所有代码":["6.6"],"都通用的":["6.7"],"例如":["6.7"],"作用":["6.7"],"title":["6.7"],"一级标题":["6.8"],"最大的标题":["6.8"],"h2":["6.8"],"二级标题":["6.8"],"h3":["6.8"],"块级元素":["6.9"],"tip":["6.9","6.14","6.15"],"a标签的特有属性":["6.10"],"href来指定要跳转的链接地址":["6.10"],"id":["6.10"],"html文档书签":["6.10"],"他没有结束标签":["6.11"],"它是靠属性来操作标签":["6.11"],"meta":["6.12"],"网页的元信息":["6.12"],"link":["6.12"],"定义网页的标题":["6.13"],"name":["6.17"],"keywords":["6.17"],"内容":["6.17"],"网页的描述内容":["6.17"],"ol":["6.18"]},{"50":["2.2"],"警告":["0.0"],"学习不分年纪":["0.0"],"你这么年轻":["0.0"],"1px":["2.1"],"solid":["2.1"],"f40":["2.1","2.3","2.4","2.6"],"absolute":["2.1","2.3"],"left":["2.2"],"25px":["2.2"],"子元素绝对定位":["2.3"],"top":["2.3"],"height":["2.4","2.8"],"background":["2.4","2.6"],"color":["2.4","2.6"],"center":["2.5","3.8"],"justify":["2.5"],"content":["2.5"],"width":["2.5"],"200px":["2.5"],"inline":["2.6"],"block":["2.6"],"flex布局":["2.7"],"grid布局":["2.7"],"单行文本父元素确认高度":["2.8"],"line":["2.8"],"定高":["2.9"],"display":["2.9"],"item":["3.1","3.11","3.14","3.16"],"be830d6d00ea4c3f9434a5e61fbb2286":["3.1"],"容器中存在两条轴":["3.1"],"主轴":["3.1"],"reverse":["3.4"],"换行":["3.5"],"的简写":["3.6"],"居中":["3.7"],"space":["3.7"],"between":["3.7","3.9"],"交叉轴的终点对齐":["3.8"],"与交叉轴两端对齐":["3.9"],"轴线之间的间隔平均分布":["3.9"],"css":["3.11","3.14","3.16"],"如果有的话":["3.12"],"如果一个项目的":["3.12"],"属性都为1":["3.13"],"当空间不足时":["3.13"],"都将等比例缩小":["3.13"],"决定":["3.14"],"主轴方向":["3.14"],"没有设置则由内容决定":["3.14"],"常用于固定尺寸不伸缩":["3.15"],"stretch":["3.16"],"html5标准还没有发布之前所有的标准的统称":["6.0"],"自己的理解":["6.0"],"markup":["6.2"],"language":["6.2"],"title":["6.3","6.12"],"我是第一个html文件":["6.3"],"htm":["6.4"],"是一套":["6.5"],"大多数":["6.6"],"text":["6.7"],"规定元素的额外信息":["6.7"],"可在工具提示中显示":["6.7"],"class":["6.7"],"classname":["6.7"],"规定元素的类名":["6.7"],"三级标题":["6.8"],"h4":["6.8"],"四级标题":["6.8"],"h5":["6.8"],"五级标题":["6.8"],"段落":["6.9"],"paragraph":["6.9"],"href":["6.10"],"要跳转的地址":["6.10"],"target":["6.10"],"blank":["6.10"],"这是一个超链接":["6.10"],"src":["6.11"],"图片的链接":["6.11"],"alt":["6.11"],"图片失效后所呈现的文字":["6.11"],"定义文档与外部资源的联系":["6.12"],"网页的标题":["6.12"],"这是文档必需的":["6.13"],"浏览器工具栏的标题":["6.13"],"用于加载脚本文件":["6.16"],"也可以在body中元素之后加载js文件":["6.16"],"description":["6.17"],"dl":["6.18"]},{"0":["2.1"],"50":["2.3"],"肯定是学习的领班人":["0.0"],"学累了":["0.0"],"一定要适当休息":["0.0"],"子元素绝对定位":["2.1"],"top":["2.1"],"right":["2.1"],"bottom":["2.1"],"50px":["2.2","2.4","2.6"],"background":["2.2","2.5"],"color":["2.2","2.5"],"8df":["2.2","2.4","2.6"],"整个实现思路如下图所示":["2.2"],"f99f78f4d54d478fa59b236c7a010a94":["2.2"],"初始位置为":["2.2"],"left":["2.3"],"translate":["2.3","2.9"],"height":["2.5","6.11"],"f40":["2.5"],"设置父元素为":["2.6"],"根据元素标签的性质":["2.7"],"可以分为":["2.7"],"多行文本父元素确认高度":["2.8"],"table":["2.9"],"cell":["2.9"],"transform":["2.9"],"x":["2.9"],"和":["3.1"],"交叉轴":["3.1"],"呈90度":["3.1"],"每条轴都有":["3.1"],"起点":["3.1"],"起点在右侧":["3.4"],"column":["3.4"],"主轴为垂直方向":["3.4"],"reverse":["3.5"],"两端对齐":["3.7"],"项目之间的间隔都相等":["3.7"],"baseline":["3.8"],"项目第一行文字的基线对齐":["3.8"],"around":["3.9"],"每根轴线两侧的间隔都相等":["3.9"],"所以":["3.9"],"轴线之间的间隔比轴线与边框的间隔大一倍":["3.9"],"属性为2":["3.12"],"其他项目都为1":["3.12"],"则前者占据的剩余空间将比其他项多一倍":["3.12"],"如果一个项目的":["3.13"],"属性为0":["3.13"],"length":["3.14"],"default":["3.14"],"的区别":["3.15"],"可以归结于":["3.15"],"flex":["3.16"],"在这里有些代码用到了html5标准的东西":["6.0"],"简称":["6.2"],"body":["6.3"],"h1":["6.3"],"我的第一个标题":["6.3"],"以上两个后缀名没有区别":["6.4"],"标记标签":["6.5"],"可以嵌套":["6.6"],"html元素可以包含其他":["6.6"],"id":["6.7"],"规定元素的唯一":["6.7"],"六级标题":["6.8"],"最小的标题":["6.8"],"warning":["6.8"],"注意":["6.8"],"标题标签只能用于标题":["6.8"],"可以把html文档分成一个个段落":["6.9"],"id属性":["6.10"],"这里的id属性是可以配合其它的超链接实现定位":["6.10"],"href属性":["6.10"],"填写要跳转的地址":["6.10"],"target属性":["6.10"],"定义被链接的文档在何处显示":["6.10"],"blank是在新的标签页打开":["6.10"],"width":["6.11"],"图片的宽度":["6.11"],"图片的高度":["6.11"],"设置图片的大小是个好习惯":["6.11"],"内联的样式表":["6.12"],"js脚本":["6.12"],"收藏网页时":["6.13"],"定义文档与外部资源之间的联系":["6.14"],"可以直接添加样式":["6.15"],"因为先让浏览器加载html结构和css样式":["6.16"],"定义网页的作者":["6.17"],"author":["6.17"]},{"danger":["0.0"],"危险":["0.0"],"早睡早起":["0.0"],"left":["2.1"],"撑满了整个父级":["2.1"],"实现水平垂直居中":["2.1"],"方块1":["2.2"],"的位置":["2.2"],"当设置left":["2.2"],"top为50":["2.2"],"的时候":["2.2"],"内部子元素为":["2.2"],"方块2":["2.2"],"设置margin为负数时":["2.2"],"将元素位移自己宽度和高度的":["2.3"],"50px":["2.3","2.5"],"background":["2.3"],"flex布局是实现水平垂直居中的最简单最快的方法":["2.4"],"flex时":["2.4"],"表示该容器内部的元素将按照flex进行布局":["2.4"],"子元素设置":["2.6"],"利用":["2.6"],"行内元素居中布局":["2.7"],"块级元素居中布局":["2.7"],"table":["2.8"],"cell":["2.8"],"vertical":["2.8"],"y":["2.9"],"flex":["2.9"],"不定高":["2.9"],"不定宽":["2.9"],"终点":["3.1"],"项目默认是沿着主轴排列":["3.1"],"可以用":["3.1"],"起点在上沿":["3.4"],"但是方向与wrap方向相反":["3.5"],"around":["3.7"],"主轴与边框的距离是项目之间距离的一半":["3.7"],"stretch":["3.8","3.9"],"默认值":["3.8"],"如果项目未设置宽高或者设为auto":["3.8"],"evenly":["3.9"],"间隔都一样":["3.9"],"integer":["3.11"],"弹性容器的宽度正好等于元素宽度总和":["3.12"],"无多余宽度":["3.12"],"此时无论":["3.12"],"其他项目都为1":["3.13"],"则空间不足时":["3.13"],"前者不缩小":["3.13"],"在容器宽度有剩余时":["3.13"],"当设置为0的是":["3.14"],"会根据内容撑开":["3.14"],"它可以设为跟":["3.14"],"或":["3.14"],"当设置为0时":["3.15"],"绝对弹性元素":["3.15"],"此时相当于告诉":["3.15"],"在伸缩的时候不需要考虑我的尺寸":["3.15"],"start":["3.16"],"end":["3.16"],"center":["3.16"],"因为html5已经是一个经典的版本":["6.0"],"html":["6.2","6.9"],"是一种用于创建网页的标准标记语言":["6.2"],"p":["6.3"],"我的第一个段落":["6.3"],"均可使用":["6.4"],"使用":["6.5"],"html文档":["6.6"],"由相互嵌套的":["6.6"],"style":["6.7"],"definition":["6.7"],"规定元素的行内样式":["6.7"],"warning":["6.7"],"注意":["6.7"],"不要仅仅为了生成粗体或大号字体而使用标题标签":["6.8"],"标题标签很重要":["6.8"],"因为用户可以通过标题快速的浏览网页":["6.8"],"应该将":["6.8"],"用作主标题":["6.8"],"最重要的":["6.8"],"这是一个段落标签":["6.9"],"默认是在本身标签上打开":["6.10"],"在默认情况下":["6.10"],"a标签具有以下的特点":["6.10"],"鼠标悬停在链接上会变成小手":["6.10"],"一个未访问过的链接显示为蓝色字体并带有下划线":["6.10"],"访问过的链接显示为紫色并带有下划线":["6.10"],"如果不设置就会影响页面的布局":["6.11"],"如果页面加载的图片过多":["6.11"],"不能一次性全都加载出来":["6.11"],"因为加载图片需要时间":["6.11"],"base":["6.12"],"基本的链接地址":["6.12"],"链接目标":["6.12"],"收藏夹中的标题":["6.13"],"搜索引擎结果页面的标题":["6.13"],"通常链接到外部的样式文件":["6.14"],"最后再加载js脚本":["6.16"],"这样效果会很好":["6.16"],"每30秒钟刷新当前页面":["6.17"],"http":["6.17"],"equiv":["6.17"],"refresh":["6.17"]},{"30":["6.17"],"禁止熬夜":["0.0"],"身体是革命的本钱":["0.0"],"50px":["2.1"],"background":["2.1"],"color":["2.1","2.3"],"8df":["2.1","2.3","2.5"],"使内部子元素到":["2.2"],"方块3":["2.2"],"即中间位置":["2.2"],"这种方法不要求父元素的高度":["2.2"],"也就是即使父元素的高度变化了":["2.2"],"仍然可以保持在父元素的垂直居中位置":["2.2"],"但是该方案需要知道子元素自身的宽高":["2.2"],"可以说这种方法是":["2.3"],"margin":["2.3"],"负值的替代方案":["2.3"],"并不需要知道自身元素的宽高":["2.3"],"表示这些元素将相对于本容器水平居中":["2.4"],"也是同样的道理垂直居中":["2.4"],"grid网格布局和flex布局是一样的简单":["2.5"],"和":["2.6"],"可以让所有的行内块级元素水平垂直居中":["2.6"],"middle":["2.8"],"grid":["2.9"],"兼容性相对比较差":["2.9"],"direction":["3.1"],"属性改变":["3.1"],"起点在下沿":["3.4"],"evenly":["3.7"],"间隔都一样":["3.7"],"将沾满整个容器的高度":["3.8"],"默认值":["3.9"],"轴线占满整个交叉轴":["3.9"],"是什么值都不会生效":["3.12"],"也是不会生效的":["3.13"],"属性一样的值":["3.14"],"比如350px":["3.14"],"则项目将占据固定空间":["3.14"],"当设置为":["3.15"],"时":["3.15"],"相对弹性元素":["3.15"],"此时则需要在伸缩时将元素尺寸纳入考虑":["3.15"],"注":["3.15"],"优先使用这个值":["3.15"],"不要单独拆开写":["3.15"],"因为浏览器会推算这些值":["3.15"],"baseline":["3.16"],"来描述网页":["6.5"],"html元素构成":["6.6"],"其它的属性都是其它标签独有的":["6.7"],"也有一样的":["6.7"],"而上面的四种属性都是通用的":["6.7"],"所以等看到其它标签的时候再仔细研究这些属性":["6.7"],"其后是":["6.8"],"次重要的":["6.8"],"再其次是":["6.8"],"以此类推":["6.8"],"点击链接时":["6.10"],"链接显示为红色并带有下划线":["6.10"],"warning":["6.10"],"注意":["6.10"],"这里的默认样式是可以通过后面的css样式更改":["6.10"],"所以需要图片懒加载":["6.11"],"图片链接一定要写对":["6.11"],"不然会显示裂开的图片":["6.11"],"需要了解的":["6.17"],"可以去mdn去查看":["6.17"]}]'},n={"0.0":{t:"<br>\r",p:`&lt;br&gt;
&lt;br&gt;
&lt;br&gt;
&lt;br&gt;
::: tip 你可以的
不能盲目学习，也要掌握技巧
相信自己，超越自己
:::
::: warning 警告
 ...`,l:"index.html",a:"br"},"1.0":{t:":::info 我的知识库搭建过程",p:`这里可以看到我的知识库搭建的过程，如果你也想要搭建一个属于你自己的知识库，这里会有你的答案
:::
`,l:"notebuild/index.html",a:"info-我的知识库搭建过程"},"2.0":{t:"# 元素的水平垂直居中\r",p:"\r",l:"web-study/interview/001.html",a:"元素的水平垂直居中"},"2.1":{t:"定位 + margin: auto\r",p:`&lt;html&gt;
    &lt;title&gt;&lt;/title&gt;
    &lt;body&gt;
        &lt;div class='father'&gt;
    ...`,l:"web-study/interview/001.html#定位-margin-auto",a:"定位-margin-auto"},"2.2":{t:"定位 + margin：负值\r",p:`&lt;html&gt;
    &lt;title&gt;&lt;/title&gt;
    &lt;body&gt;
        &lt;div class='father'&gt;
    ...`,l:"web-study/interview/001.html#定位-margin-负值",a:"定位-margin-负值"},"2.3":{t:"定位 + transform\r",p:`&lt;html&gt;
    &lt;title&gt;&lt;/title&gt;
    &lt;body&gt;
        &lt;div class='father'&gt;
    ...`,l:"web-study/interview/001.html#定位-transform",a:"定位-transform"},"2.4":{t:"flex弹性布局\r",p:`&lt;html&gt;
    &lt;title&gt;&lt;/title&gt;
    &lt;body&gt;
        &lt;div class='father'&gt;
    ...`,l:"web-study/interview/001.html#flex弹性布局",a:"flex弹性布局"},"2.5":{t:"grid网格布局\r",p:`&lt;html&gt;
    &lt;title&gt;&lt;/title&gt;
    &lt;body&gt;
        &lt;div class='father'&gt;
    ...`,l:"web-study/interview/001.html#grid网格布局",a:"grid网格布局"},"2.6":{t:"table布局\r",p:`&lt;html&gt;
    &lt;title&gt;&lt;/title&gt;
    &lt;body&gt;
        &lt;div class='father'&gt;
    ...`,l:"web-study/interview/001.html#table布局",a:"table布局"},"2.7":{t:"总结\r",p:`
上述方法中，不知道元素宽高大小仍能实现水平垂直居中的方法有：

利用定位 + margin:auto
利用定位 + transform
flex布局
grid布局


根据元素标签的性质，可以分为： ...`,l:"web-study/interview/001.html#总结",a:"总结"},"2.8":{t:"元素居中布局\r",p:`
水平居中

行内元素可设置：text-align: center
flex布局设置父元素：display: flex; justify-content: center

垂直居中

单行文本父元素确 ...`,l:"web-study/interview/001.html#元素居中布局",a:"元素居中布局"},"2.9":{t:"块级元素居中布局\r",p:`
水平居中

定宽: margin: 0 auto
绝对定位+left:50% + margin:负自身一半

垂直居中

position: absolute设置 left、top、margin-l ...`,l:"web-study/interview/001.html#块级元素居中布局",a:"块级元素居中布局"},"3.0":{t:"# flex布局\r",p:"\r",l:"web-study/interview/002.html",a:"flex布局"},"3.1":{t:"什么是flex布局\r",p:`
Flexible Box 简称 flex
弹性布局， 可以简便、完整、响应式地实现各种页面布局


采用Flex布局的元素，称为 flex 容器 [container]
它的所有子元素自动成为容器成 ...`,l:"web-study/interview/002.html#什么是flex布局",a:"什么是flex布局"},"3.2":{t:"属性\r",p:`flex常见的属性可分为两种：

容器属性
容器成员属性

`,l:"web-study/interview/002.html#属性",a:"属性"},"3.3":{t:"容器属性\r",p:"\r",l:"web-study/interview/002.html#容器属性",a:"容器属性"},"3.4":{t:"flex-direction\r",p:`
决定主轴的方向,就是项目的排列方向


flex-direction

row (默认值):      主轴为水平方向，起点在左侧
row-reverse:      主轴为水平方向，起点在右侧
c ...`,l:"web-study/interview/002.html#flex-direction",a:"flex-direction"},"3.5":{t:"flex-wrap\r",p:`
决定容器中的项目是否换行


flex-wrap

nowrap (默认值)：   不换行
wrap：             换行
wrap-reverse：      换行，但是方向与wrap方 ...`,l:"web-study/interview/002.html#flex-wrap",a:"flex-wrap"},"3.6":{t:"flex-flow\r",p:`
这是flex-direction 与 flex-wrap的简写


flex-flow: [flex-direction] || [flex-wrap]

`,l:"web-study/interview/002.html#flex-flow",a:"flex-flow"},"3.7":{t:"justify-content\r",p:`
决定了项目在主轴上的对齐方式


justify-content

flex-start(默认值):    左对齐
flex-end:            右对齐
center:          ...`,l:"web-study/interview/002.html#justify-content",a:"justify-content"},"3.8":{t:"align-items\r",p:`
决定了项目在交叉轴上的对齐方式


align-items

flex-start:            交叉轴的起点对齐
flex-end:      交叉轴的终点对齐
center:      ...`,l:"web-study/interview/002.html#align-items",a:"align-items"},"3.9":{t:"align-content\r",p:`
决定了多条轴线的对齐方式，如果项目只有一条轴线，那这个属性不起作用


align-content

flex-start:            与交叉轴的起点对齐
flex-end:       ...`,l:"web-study/interview/002.html#align-content",a:"align-content"},"3.10":{t:"容器成员属性\r",p:"\r",l:"web-study/interview/002.html#容器成员属性",a:"容器成员属性"},"3.11":{t:"order\r",p:`
定义项目的排列顺序。数值越小，排列越靠前，默认为0

.item {
    order: &lt;integer&gt;;
}

`,l:"web-study/interview/002.html#order",a:"order"},"3.12":{t:"flex-grow\r",p:`
定义项目的放大比例（容器宽度&gt;元素总宽度时如何伸展）


默认为0，即如果存在剩余空间，也不放大
如果所有项目的flex-grow属性都为1，则它们将等分剩余空间（如果有的话）
如果一个项目的 ...`,l:"web-study/interview/002.html#flex-grow",a:"flex-grow"},"3.13":{t:"flex-shrink\r",p:`
定义了项目的缩小比例（容器宽度&lt;元素总宽度时如何收缩）


默认为1，即如果空间不足，该项目将缩小

.item {
    flex-shrink: &lt;number&gt;; /def ...`,l:"web-study/interview/002.html#flex-shrink",a:"flex-shrink"},"3.14":{t:"flex-basis\r",p:`
设置的是元素在主轴上的初始尺寸
初始尺寸是元素在 flex-grow 和 flex-shrink 生效前的尺寸


浏览器根据这个属性，计算主轴是否有多余空间，默认值为auto，即项目的本来大小，如 ...`,l:"web-study/interview/002.html#flex-basis",a:"flex-basis"},"3.15":{t:"flex\r",p:`
flex属性是flex-grow, flex-shrink 和 flex-basis的简写，默认值为0 1 auto，也是比较难懂的一个复合属性

.item {
  flex: none | [  ...`,l:"web-study/interview/002.html#flex",a:"flex"},"3.16":{t:"align-self\r",p:`
允许单个项目有与其他项目不一样的对齐方式   可以覆盖align-items属性


默认值为auto，表示继承父元素的align-items属性，如果没有父元素，则等同于stretch

.ite ...`,l:"web-study/interview/002.html#align-self",a:"align-self"},"3.17":{t:"应用场景\r",p:`元素水平垂直居中
三栏两栏布局
移动端、小程序都建议使用flex弹性布局
`,l:"web-study/interview/002.html#应用场景",a:"应用场景"},"4.0":{t:":::tip 提示",p:`这是一些面试题
:::
`,l:"web-study/interview/index.html",a:"tip-提示"},"6.0":{t:"# html4\r",p:`:::warning 开始之前你要明白
html4 是 html5标准还没有发布之前所有的标准的统称（自己的理解）
在这里有些代码用到了html5标准的东西，因为html5已经是一个经典的版本
::: ...`,l:"web-study/studynotes/htmlnotes/html01.html",a:"html4"},"6.1":{t:"1.什么是html\r",p:"\r",l:"web-study/studynotes/htmlnotes/html01.html#_1-什么是html",a:"_1-什么是html"},"6.2":{t:"1.1-定义\r",p:`
超文本标记语言（英语：HyperText Markup Language，简称：HTML）
是一种用于创建网页的标准标记语言。

`,l:"web-study/studynotes/htmlnotes/html01.html#_1-1-定义",a:"_1-1-定义"},"6.3":{t:"1.2-html 的基本骨架\r",p:`&lt;!DOCTYPE html&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;meta charset=&quot;utf-8&quot;&gt;
    &lt ...`,l:"web-study/studynotes/htmlnotes/html01.html#_1-2-html-的基本骨架",a:"_1-2-html-的基本骨架"},"6.4":{t:"1.3-后缀名\r",p:`
.html
.htm

以上两个后缀名没有区别，均可使用
`,l:"web-study/studynotes/htmlnotes/html01.html#_1-3-后缀名",a:"_1-3-后缀名"},"6.5":{t:"1.4-总结\r",p:`
HTML 不是一种编程语言，而是一种标记语言
标记语言 是一套标记标签
HTML 使用标记标签来描述网页

`,l:"web-study/studynotes/htmlnotes/html01.html#_1-4-总结",a:"_1-4-总结"},"6.6":{t:"2.Html元素\r",p:`::: tip html元素
指的是从 [开放标签] 到 [结束标签] 的所有代码
:::

大多数 HTML元素 可以嵌套（HTML元素可以包含其他 HTML元素）
HTML文档 由相互嵌套的 HT ...`,l:"web-study/studynotes/htmlnotes/html01.html#_2-html元素",a:"_2-html元素"},"6.7":{t:"3.Html属性\r",p:`:::tip 属性
是为元素提供附属信息的
:::

html标签 是可以书写属性的
但是属性是要写在开放标签上的
属性的写法，主要都是 以 “属性名='属性值'” 的形式书写
有一些属性是所有 ht ...`,l:"web-study/studynotes/htmlnotes/html01.html#_3-html属性",a:"_3-html属性"},"6.8":{t:"4.标题标签[h1~h6]\r",p:`:::info 分类:
· 它属于排版标签
· 双标签
· 块级元素
:::
:::tip 标题(header)
标题标签 有六种 分别有 h1~h6
从定义上讲，h1是最大的标题，h6是最小的
:: ...`,l:"web-study/studynotes/htmlnotes/html01.html#_4-标题标签-h1-h6",a:"_4-标题标签-h1-h6"},"6.9":{t:"5.段落标签[p]\r",p:`:::info 分类:
· 它属于排版标签
· 双标签
· 块级元素
:::
:::tip 段落(paragraph)
段落标签 p 可以把html文档分成一个个段落
:::
&lt;p&gt;这是一 ...`,l:"web-study/studynotes/htmlnotes/html01.html#_5-段落标签-p",a:"_5-段落标签-p"},"6.10":{t:"6.链接标签[a]\r",p:`:::info 分类:
· 它属于链接标签
· 双标签
· 行内元素
:::
:::tip 超链接(链接)
使用标签 a 来设置超文本链接
超链接可以是一个字、一个词、一张图......
点击它可以跳 ...`,l:"web-study/studynotes/htmlnotes/html01.html#_6-链接标签-a",a:"_6-链接标签-a"},"6.11":{t:"7.图像标签[img]\r",p:`:::info 分类:
· 它属于图像标签
· 行内块元素
· 单标签
:::
::: tip 图像标签
这个标签可以在页面上显示图片
img 是空标签，他没有结束标签
它是靠属性来操作标签
:::
 ...`,l:"web-study/studynotes/htmlnotes/html01.html#_7-图像标签-img",a:"_7-图像标签-img"},"6.12":{t:"8.Html文档[head标签]\r",p:`:::tip head标签
它包含了所有头部标签元素
&lt;head&gt;
	&lt;meta /&gt; 网页的元信息
	&lt;link /&gt; 定义文档与外部资源的联系
	&lt;tit ...`,l:"web-study/studynotes/htmlnotes/html01.html#_8-html文档-head标签",a:"_8-html文档-head标签"},"6.13":{t:"8.1-title标签\r",p:`:::tip title标签
定义网页的标题
这是文档必需的
:::

浏览器工具栏的标题
收藏网页时，收藏夹中的标题
搜索引擎结果页面的标题

`,l:"web-study/studynotes/htmlnotes/html01.html#_8-1-title标签",a:"_8-1-title标签"},"6.14":{t:"8.2-link标签\r",p:`:::tip link标签
定义文档与外部资源之间的联系
通常链接到外部的样式文件
:::
`,l:"web-study/studynotes/htmlnotes/html01.html#_8-2-link标签",a:"_8-2-link标签"},"6.15":{t:"8.3-style标签\r",p:`:::tip style标签
可以直接添加样式
:::
`,l:"web-study/studynotes/htmlnotes/html01.html#_8-3-style标签",a:"_8-3-style标签"},"6.16":{t:"8.4-script标签\r",p:`:::tip script标签
用于加载脚本文件
也可以在body中元素之后加载js文件
因为先让浏览器加载html结构和css样式，最后再加载js脚本，这样效果会很好
:::
`,l:"web-study/studynotes/htmlnotes/html01.html#_8-4-script标签",a:"_8-4-script标签"},"6.17":{t:"8.5-meta标签\r",p:`:::tip meta标签
定义网页的元信息，它不会显示在网页中，但会被浏览器解析
通常用于指定网页的描述，关键词，文件的最后修改时间，作者，和其他元数据
:::
搜索引擎的关键词
&lt;meta  ...`,l:"web-study/studynotes/htmlnotes/html01.html#_8-5-meta标签",a:"_8-5-meta标签"},"6.18":{t:"9.列表标签[ul,ol,dl]\r",p:`\r
\r
\r`,l:"web-study/studynotes/htmlnotes/html01.html#_9-列表标签-ul-ol-dl",a:"_9-列表标签-ul-ol-dl"},"6.19":{t:"10.表格标签[table]\r",p:`\r
\r
\r`,l:"web-study/studynotes/htmlnotes/html01.html#_10-表格标签-table",a:"_10-表格标签-table"},"6.20":{t:"11.表单标签[form]\r",p:`
`,l:"web-study/studynotes/htmlnotes/html01.html#_11-表单标签-form",a:"_11-表单标签-form"},"8.0":{t:":::tip 指引一下",p:`这是我学习前端的学习笔记
:::
`,l:"web-study/studynotes/index.html",a:"tip-指引一下"}},e={previewLength:100,buttonLabel:"搜索",placeholder:"请输入关键词",allow:[],ignore:[]},l={INDEX_DATA:t,PREVIEW_LOOKUP:n,Options:e};export{l as default};
