const t={map:'[{"br":["0.0"],"info":["1.0"],"元素的水平垂直居中":["2.0"],"定位":["2.1","2.2","2.3"],"flex弹性布局":["2.4"],"grid网格布局":["2.5"],"table布局":["2.6"],"总结":["2.7"],"元素居中布局":["2.8"],"块级元素居中布局":["2.9"],"flex布局":["3.0"],"什么是flex布局":["3.1"],"属性":["3.2"],"容器属性":["3.3"],"flex":["3.4","3.5","3.6","3.12","3.13","3.14","3.15"],"justify":["3.7"],"align":["3.8","3.9","3.16"],"容器成员属性":["3.10"],"order":["3.11"],"应用场景":["3.17"],"tip":["4.0","9.0"],"html4":["7.0"],"html5":["8.0"]},{"0":["2.9"],"1":["7.1","7.2","7.3","7.4","7.5","7.19","7.27","8.1","8.2","8.11"],"2":["7.3","7.6","7.20","8.2","8.8","8.12"],"3":["7.7","7.21","8.3"],"4":["7.8","8.4"],"5":["7.9","7.17","8.5"],"6":["7.10","8.6","8.7","8.8"],"7":["7.11","8.9"],"8":["7.12","7.13","7.14","7.15","7.16","7.17","8.10","8.11","8.12"],"9":["7.18","7.19","7.20","7.21","8.13"],"10":["7.22"],"11":["7.23"],"12":["7.24"],"13":["7.25"],"14":["7.26","7.27","7.28"],"15":["7.29","7.30"],"我的知识库搭建过程":["1.0"],"margin":["2.1","2.2","2.9"],"auto":["2.1"],"html":["2.1","2.2","2.3","2.4","2.5","2.6","7.3"],"title":["2.1","2.2","2.3","2.4","2.5","2.6"],"负值":["2.2"],"body":["2.2","2.3","2.4","2.5","2.6"],"div":["2.2","2.3","2.4","2.6"],"class":["2.2","2.6"],"transform":["2.3"],"上述方法中":["2.7"],"水平居中":["2.8","2.9"],"行内元素可设置":["2.8"],"text":["2.8"],"定宽":["2.9"],"flexible":["3.1"],"box":["3.1"],"简称":["3.1"],"flex":["3.1"],"flex常见的属性可分为两种":["3.2"],"direction":["3.4"],"决定":["3.4"],"wrap":["3.5"],"flow":["3.6"],"content":["3.7","3.9"],"决定了项目在主轴上的对齐方式":["3.7"],"items":["3.8"],"决定了项目在交叉轴上的对齐方式":["3.8"],"决定了多条轴线的对齐方式":["3.9"],"如果项目只有一条轴线":["3.9"],"定义项目的排列顺序":["3.11"],"grow":["3.12","3.15"],"定义项目的放大比例":["3.12"],"容器宽度":["3.12","3.13"],"shrink":["3.13","3.15"],"定义了项目的缩小比例":["3.13"],"元素总宽度时如何收缩":["3.13"],"basis":["3.14","3.15"],"设置的是元素在主轴上的初始尺寸":["3.14"],"初始尺寸":["3.14"],"是元素在":["3.14"],"属性是":["3.15"],"和":["3.15"],"的简写":["3.15"],"self":["3.16"],"允许单个项目有与其他项目不一样的对齐方式":["3.16"],"可以覆盖":["3.16"],"元素水平垂直居中":["3.17"],"提示":["4.0"],"warning":["7.0","8.1"],"html元素":["7.6"],"html属性":["7.7"],"tip":["7.7","7.17","7.22","7.23","7.25","8.1","8.5","8.8","8.9"],"属性":["7.7"],"是为元素提供附属信息的":["7.7"],"标题标签":["7.8"],"h1":["7.8"],"h6":["7.8"],"info":["7.8","7.10","7.11"],"分类":["7.8","7.10"],"它属于排版标签":["7.8"],"段落标签":["7.9"],"链接标签":["7.10"],"a":["7.10"],"它属于链接标签":["7.10"],"图像标签":["7.11"],"img":["7.11"],"html文档":["7.12"],"meta标签":["7.17"],"无序列表标签":["7.19"],"有序列表标签":["7.20"],"自定义列表标签":["7.21"],"表格标签":["7.22"],"table":["7.22"],"table标签可以用来创建表格":["7.22"],"每个表格都有若干行":["7.22"],"使用":["7.22"],"tr":["7.22"],"标签来定义":["7.22"],"表单标签":["7.23"],"form":["7.23"],"form标签用来收集用户的输入信息":["7.23"],"文档中有一块区域":["7.23"],"里面有表单控件":["7.23"],"收集用户输入的信息":["7.23"],"并提交到对应的web服务器上":["7.23"],"html区块元素":["7.24"],"html字符实体":["7.25"],"字符实体":["7.25"],"文本格式化标签":["7.27"],"什么是html5":["8.1"],"注意":["8.1"],"html5是html最新的修订版本":["8.1"],"2014年10月由万维网联盟":["8.1"],"w3c":["8.1"],"完成标准制定":["8.1"],"html5的设计目的是为了在移动设备上支持多媒体":["8.1"],"html5相比于html4多了哪些东西":["8.2"],"html5":["8.2"],"支持多媒体":["8.2"],"video":["8.2"],"视频":["8.2"],"audio":["8.2"],"音频":["8.2"],"支持开发应用":["8.2"],"xhtmlhttprequest":["8.2"],"svg矢量图":["8.5"],"可以使用svg标签定义可缩放矢量图形":["8.5"],"优势":["8.5"],"本地数据存储":["8.6"],"sessionstorage":["8.8"],"语义化标签":["8.9"],"顾名思义":["8.9"],"就是有语义的标签":["8.9"],"它能够告诉开发者和浏览器":["8.9"],"audio标签":["8.11"],"定义声音":["8.11"],"video标签":["8.12"],"定义视频":["8.12"],"电影片段或其他视频流":["8.12"],"支持三种视频格式":["8.12"],"指引一下":["9.0"]},{"0":["3.12","3.15"],"1":["3.15","7.13","7.30","8.7"],"2":["7.14","7.28"],"3":["7.4","7.15","8.2"],"4":["7.5","7.16"],"50":["2.9"],"tip":["0.0","7.6","7.8","7.10","7.12","7.19","7.20","7.21"],"这里可以看到我的知识库搭建的过程":["1.0"],"body":["2.1"],"div":["2.1","2.5","8.9"],"class":["2.1","2.3","2.4","2.5"],"father":["2.1","2.2","2.3","2.4","2.5","2.6"],"son":["2.1","2.2","2.3","2.4","2.6"],"css":["2.2","3.13","3.15"],"不知道元素宽高大小仍能实现水平垂直居中的方法有":["2.7"],"利用定位":["2.7"],"align":["2.8"],"center":["2.8"],"flex布局设置父元素":["2.8"],"auto":["2.9","3.15"],"绝对定位":["2.9"],"left":["2.9"],"弹性布局":["3.1"],"可以简便":["3.1"],"完整":["3.1"],"响应式地实现各种页面布局":["3.1"],"容器属性":["3.2"],"主轴":["3.4"],"的方向":["3.4"],"就是项目的排列方向":["3.4"],"决定容器中的项目是否换行":["3.5"],"这是":["3.6"],"flex":["3.7","3.9"],"start":["3.7"],"那这个属性不起作用":["3.9"],"数值越小":["3.11"],"元素总宽度时如何伸展":["3.12"],"默认为":["3.12"],"默认为1":["3.13"],"即如果空间不足":["3.13"],"该项目将缩小":["3.13"],"grow":["3.14"],"和":["3.14","8.9"],"shrink":["3.14"],"生效前的尺寸":["3.14"],"默认值为":["3.15","3.16"],"也是比较难懂的一个复合属性":["3.15"],"item":["3.15"],"none":["3.15"],"items":["3.16"],"属性":["3.16"],"三栏两栏布局":["3.17"],"这是一些面试题":["4.0"],"开始之前你要明白":["7.0"],"什么是html":["7.1"],"定义":["7.2"],"的基本骨架":["7.3"],"doctype":["7.3"],"总结":["7.5"],"html标签":["7.7"],"是可以书写属性的":["7.7"],"但是属性是要写在开放标签上的":["7.7"],"属性的写法":["7.7"],"主要都是":["7.7"],"以":["7.7"],"双标签":["7.8","7.10"],"块级元素":["7.8"],"标题":["7.8"],"header":["7.8"],"有六种":["7.8"],"p":["7.9"],"info":["7.9","8.6"],"行内元素":["7.10"],"超链接":["7.10"],"链接":["7.10"],"使用标签":["7.10"],"分类":["7.11"],"它属于图像标签":["7.11"],"行内块元素":["7.11"],"单标签":["7.11"],"head标签":["7.12"],"title标签":["7.13"],"定义网页的元信息":["7.17"],"它不会显示在网页中":["7.17"],"但会被浏览器解析":["7.17"],"通常用于指定网页的描述":["7.17"],"关键词":["7.17"],"列表标签":["7.18"],"ul":["7.19"],"无序列表":["7.19"],"ol":["7.20"],"有序列表":["7.20"],"dl":["7.21"],"自定义列表":["7.21"],"每行都被分割成若干个单元格":["7.22"],"td":["7.22"],"是table":["7.22"],"data":["7.22"],"的缩写":["7.22"],"数据单元格的内容":["7.22"],"数据单元格可以包含文本":["7.22"],"图片":["7.22"],"html":["7.23","7.24","7.25","7.26"],"基本骨架":["7.23"],"action":["7.23"],"目标服务器的地址":["7.23"],"method":["7.23"],"get":["7.23"],"post":["7.23"],"target":["7.23"],"打开页面的方式":["7.23"],"表单控件":["7.23"],"input控件":["7.23"],"可以通过":["7.24"],"div标签":["7.24"],"中的预留字符必须被替换为字符实体":["7.25"],"一些在键盘上找不到的字符也可以使用字符实体来替换":["7.25"],"标签":["7.27","8.9"],"描述":["7.27"],"b":["7.27"],"计算机输出":["7.28"],"其它":["7.29"],"html5":["8.1","8.6"],"html5是下一代标准":["8.1"],"是":["8.1"],"与":["8.1"],"whatwg":["8.1"],"web":["8.1"],"hypertext":["8.1"],"application":["8.1"],"technology":["8.1"],"本地数据存储":["8.2"],"访问本地文件":["8.2"],"本地":["8.2"],"sql":["8.2"],"数据":["8.2"],"缓存引用":["8.2"],"javascript":["8.2"],"工作者":["8.2"],"支持图形":["8.2"],"使用":["8.2"],"浏览器的支持":["8.3"],"canvas标签":["8.4"],"svg":["8.5"],"图像可通过文本编辑器来创建和修改":["8.5"],"图像可被搜索":["8.5"],"索引":["8.5"],"脚本化或压缩":["8.5"],"sessionstorage存储":["8.8"],"它可以临时存储同一窗口或者":["8.8"],"同一标签页":["8.8"],"的数据":["8.8"],"如果窗口或者":["8.8"],"这个标签所表示的含义":["8.9"],"span":["8.9"],"就是无语义":["8.9"],"form":["8.9"],"媒体标签":["8.10"],"音乐或其他音频流":["8.11"],"目前这个标签仅支持":["8.11"],"mp3":["8.11"],"wav":["8.11"],"ogg":["8.11","8.12"],"mp4":["8.12"],"webm":["8.12"],"autoplay":["8.12"],"如果出现该属性":["8.12"],"新增表单控件":["8.13"],"这是我学习前端的学习笔记":["9.0"]},{"4":["8.2"],"你可以的":["0.0"],"不能盲目学习":["0.0"],"也要掌握技巧":["0.0"],"如果你也想要搭建一个属于你自己的知识库":["1.0"],"css":["2.1","2.3","2.4","2.5","2.6"],"position":["2.1","2.2","2.3","2.9"],"relative":["2.2","2.3"],"父元素相对定位":["2.2","2.3"],"width":["2.2"],"200px":["2.2"],"height":["2.2","8.12"],"border":["2.2"],"display":["2.4","2.6","2.8"],"flex":["2.4","2.8","3.8"],"justify":["2.4","2.8"],"son":["2.5"],"table":["2.6","8.9"],"cell":["2.6"],"vertical":["2.6"],"align":["2.6"],"middle":["2.6"],"margin":["2.7"],"auto":["2.7","3.14","3.16"],"负自身一半":["2.9"],"垂直居中":["2.9"],"absolute设置":["2.9"],"采用flex布局的元素":["3.1"],"称为":["3.1"],"容器":["3.1"],"container":["3.1"],"容器成员属性":["3.2"],"row":["3.4"],"nowrap":["3.5"],"direction":["3.6"],"与":["3.6"],"默认值":["3.7"],"左对齐":["3.7"],"start":["3.8","3.9"],"交叉轴的起点对齐":["3.8"],"与交叉轴的起点对齐":["3.9"],"end":["3.9"],"排列越靠前":["3.11"],"即如果存在剩余空间":["3.12"],"也不放大":["3.12"],"如果所有项目的":["3.12"],"item":["3.13"],"number":["3.13"],"浏览器根据这个属性":["3.14"],"计算主轴是否有多余空间":["3.14"],"默认值为":["3.14"],"即项目的本来大小":["3.14"],"表示继承父元素的":["3.16"],"移动端":["3.17"],"超文本标记语言":["7.2"],"head":["7.3","7.12"],"meta":["7.3","7.17"],"后缀名":["7.4"],"html":["7.5","7.8","7.12","7.17","7.22","8.9"],"不是一种编程语言":["7.5"],"指的是从":["7.6"],"开放标签":["7.6"],"到":["7.6"],"属性名":["7.7"],"属性值":["7.7"],"的形式书写":["7.7"],"有一些属性是所有":["7.7"],"分别有":["7.8"],"从定义上讲":["7.8"],"h1是最大的标题":["7.8"],"h6是最小的":["7.8"],"分类":["7.9"],"它属于排版标签":["7.9"],"双标签":["7.9"],"来设置超文本链接":["7.10"],"超链接可以是一个字":["7.10"],"一个词":["7.10"],"一张图":["7.10"],"点击它可以跳转到新的文档或者是当前文档的某个地方":["7.10"],"可以通过":["7.10"],"a标签的特有属性":["7.10"],"tip":["7.11","7.13","7.16","8.4","8.7"],"这个标签可以在页面上显示图片":["7.11"],"是空标签":["7.11"],"它包含了所有头部标签元素":["7.12"],"link标签":["7.14"],"style标签":["7.15"],"script标签":["7.16"],"文件的最后修改时间":["7.17"],"作者":["7.17"],"和其他元数据":["7.17"],"搜索引擎的关键词":["7.17"],"ul":["7.18"],"一个项目的列表":["7.19","7.20"],"此列项目使用粗体圆点":["7.19"],"典型的小黑圆圈":["7.19"],"此列项目使用":["7.20"],"数字":["7.20"],"进行标记":["7.20"],"自定义列表不仅仅是一列项目":["7.21"],"而是项目及其注释的组合":["7.21"],"自定义列表以":["7.21"],"列表":["7.22"],"段落":["7.22"],"表单":["7.22"],"水平线":["7.22"],"表格等等":["7.22"],"caption":["7.22"],"表格的表头":["7.22"],"表格头部":["7.22"],"thead":["7.22"],"文本域":["7.23"],"input":["7.23"],"type":["7.23"],"text":["7.23"],"name":["7.23"],"存储表单数据的变量名":["7.23"],"密码控件":["7.23"],"password":["7.23"],"和":["7.24"],"span标签":["7.24"],"将元素组合起来":["7.24"],"空格":["7.25"],"nbsp":["7.25"],"小于号":["7.25"],"格式化标签":["7.26"],"定义粗体文本":["7.27"],"i":["7.27"],"定义斜体字":["7.27"],"标签":["7.28"],"code":["7.28"],"还有一些标签":["7.30"],"working":["8.1"],"group":["8.1"],"合作的结果":["8.1"],"致力于":["8.1"],"表单和应用程序":["8.1"],"而":["8.1"],"专注于":["8.1"],"canvas":["8.2"],"元素":["8.2"],"使用内联":["8.2"],"svg":["8.2"],"css3":["8.2"],"2d":["8.2"],"转换":["8.2"],"3d":["8.2"],"warning":["8.3"],"html5对于浏览器的支持":["8.3"],"是可伸缩的":["8.5"],"图像可在任何的分辨率下被高质量地打印":["8.5"],"可在图像质量不下降的情况下被放大":["8.5"],"存储":["8.6"],"早期的时候浏览器是通过cookie来存储数据的":["8.6"],"localstorage":["8.7"],"标签页":["8.8"],"关闭时":["8.8"],"数据也会随之删除":["8.8"],"不管是localstorage":["8.8"],"还是sessionstorage":["8.8"],"img等":["8.9"],"就是有语义的":["8.9"],"html5":["8.9"],"现在又提供了一些新的语义标签":["8.9"],"这些标签其实就是有语义的div":["8.9"],"autoplay":["8.11"],"如果出现该属性":["8.11"],"则音频在就绪后马上播放":["8.11"],"controls":["8.11","8.12"],"则视频在就绪后马上播放":["8.12"],"则向用户显示控件":["8.12"],"比如播放按钮":["8.12"]},{"0":["8.1"],"1":["3.13"],"2":["3.15","8.1"],"5":["8.2"],"8":["7.3"],"2006":["8.1"],"相信自己":["0.0"],"超越自己":["0.0"],"warning":["0.0"],"这里会有你的答案":["1.0"],"relative":["2.1"],"父元素相对定位":["2.1"],"width":["2.1","2.3","2.4","2.6","3.14"],"200px":["2.1","2.3","2.4","2.6"],"height":["2.1","2.3","2.6","3.14"],"border":["2.1","2.3"],"1px":["2.2","2.3"],"solid":["2.2","2.3"],"f40":["2.2"],"absolute":["2.2"],"子元素绝对定位":["2.2"],"top":["2.2","2.9"],"content":["2.4","2.8","7.17"],"center":["2.4","2.6","3.7","3.9"],"align":["2.4","2.5"],"items":["2.4","2.5"],"display":["2.5"],"grid":["2.5"],"text":["2.6"],"transform":["2.7"],"垂直居中":["2.8"],"它的所有子元素自动成为容器成员":["3.1"],"项目":["3.1"],"默认值":["3.4","3.5"],"主轴为水平方向":["3.4"],"起点在左侧":["3.4"],"不换行":["3.5"],"wrap":["3.6"],"end":["3.7","3.8"],"右对齐":["3.7"],"与交叉轴的终点对齐":["3.9"],"与交叉轴的中点对齐":["3.9"],"space":["3.9"],"默认为0":["3.11"],"属性都为1":["3.12"],"则它们将等分剩余空间":["3.12"],"default":["3.13"],"如果所有项目的":["3.13"],"如设置了":["3.14"],"则元素尺寸由":["3.14"],"如果没有父元素":["3.16"],"则等同于":["3.16"],"小程序都建议使用flex弹性布局":["3.17"],"是":["7.0"],"英语":["7.2"],"hypertext":["7.2"],"charset":["7.3"],"utf":["7.3"],"html":["7.4","7.10","7.11","7.19","7.20","7.30","8.1"],"而是一种":["7.5"],"标记语言":["7.5"],"结束标签":["7.6"],"的所有代码":["7.6"],"都通用的":["7.7"],"例如":["7.7"],"作用":["7.7"],"title":["7.7"],"一级标题":["7.8"],"最大的标题":["7.8"],"h2":["7.8"],"二级标题":["7.8"],"h3":["7.8"],"块级元素":["7.9"],"tip":["7.9","7.14","7.15","7.24"],"href来指定要跳转的链接地址":["7.10"],"id":["7.10"],"html文档书签":["7.10"],"href":["7.10"],"他没有结束标签":["7.11"],"它是靠属性来操作标签":["7.11"],"meta":["7.12"],"网页的元信息":["7.12"],"link":["7.12"],"定义网页的标题":["7.13"],"name":["7.17"],"keywords":["7.17"],"内容":["7.17"],"网页的描述内容":["7.17"],"ol":["7.18"],"进行标记":["7.19"],"li":["7.19","7.20"],"我是有序列表里的一项":["7.20"],"标签开始":["7.21"],"每个自定义列表项以":["7.21"],"dt":["7.21"],"开始":["7.21"],"th":["7.22"],"表格主体":["7.22"],"tbody":["7.22"],"单选按钮":["7.23"],"radio":["7.23"],"value":["7.23"],"提交表单时的结果":["7.23"],"复选框":["7.23"],"checkbox":["7.23"],"区块元素":["7.24"],"lt":["7.25"],"大于号":["7.25"],"gt":["7.25"],"和号":["7.25"],"strong":["7.27"],"定义加重语气":["7.27"],"em":["7.27"],"定义计算机代码":["7.28"],"kbd":["7.28"],"xhtml":["8.1"],"在":["8.1"],"年":["8.1"],"双方决定进行合作":["8.1"],"来创建一个新版本的":["8.1"],"html5中新增的一些新特性":["8.1"],"用于绘画的":["8.1"],"全面支持css3":["8.2"],"新选择器":["8.2"],"新属性":["8.2"],"动画":["8.2"],"圆角":["8.2"],"阴影效果":["8.2"],"可下载的字体":["8.2"],"增加了很多语义标签":["8.2"],"对于现在大部分的浏览器都得到很好的支持":["8.3"],"定义图形的":["8.4"],"与":["8.5"],"canvas":["8.5"],"的区别":["8.5"],"是一种使用":["8.5"],"xml":["8.5"],"但是web存储要求更安全更快速":["8.6"],"这些数据不会存在服务器上":["8.6"],"localstorage存储":["8.7"],"使用的api基本相同":["8.8"],"js":["8.8"],"常用的api有以下几个":["8.8"],"localstorage":["8.8"],"setitem":["8.8"],"定义文档的头部区域":["8.9"],"header":["8.9"],"定义导航链接的部分":["8.9"],"nav":["8.9"],"定义主要内容区域":["8.9"],"则向用户显示音频控件":["8.11"],"比如播放":["8.11"],"暂停按钮":["8.11"],"pixels":["8.12"],"设置视频播放器的高度":["8.12"],"loop":["8.12"],"则当媒介文件完成播放后再次开始播放":["8.12"]},{"50":["2.2"],"警告":["0.0"],"学习不分年纪":["0.0"],"你这么年轻":["0.0"],"1px":["2.1"],"solid":["2.1"],"f40":["2.1","2.3","2.4","2.6"],"absolute":["2.1","2.3"],"left":["2.2"],"25px":["2.2"],"子元素绝对定位":["2.3"],"top":["2.3"],"height":["2.4","2.8"],"background":["2.4","2.6"],"color":["2.4","2.6"],"center":["2.5","3.8"],"justify":["2.5"],"content":["2.5"],"width":["2.5"],"200px":["2.5"],"inline":["2.6"],"block":["2.6"],"flex布局":["2.7"],"grid布局":["2.7"],"单行文本父元素确认高度":["2.8"],"line":["2.8"],"定高":["2.9"],"display":["2.9"],"item":["3.1","3.11","3.14","3.16"],"be830d6d00ea4c3f9434a5e61fbb2286":["3.1"],"容器中存在两条轴":["3.1"],"主轴":["3.1"],"reverse":["3.4"],"换行":["3.5"],"的简写":["3.6"],"居中":["3.7"],"space":["3.7"],"between":["3.7","3.9"],"交叉轴的终点对齐":["3.8"],"与交叉轴两端对齐":["3.9"],"轴线之间的间隔平均分布":["3.9"],"css":["3.11","3.14","3.16"],"如果有的话":["3.12"],"如果一个项目的":["3.12"],"属性都为1":["3.13"],"当空间不足时":["3.13"],"都将等比例缩小":["3.13"],"决定":["3.14"],"主轴方向":["3.14"],"没有设置则由内容决定":["3.14"],"常用于固定尺寸不伸缩":["3.15"],"stretch":["3.16"],"html5标准还没有发布之前所有的标准的统称":["7.0"],"自己的理解":["7.0"],"markup":["7.2"],"language":["7.2"],"title":["7.3","7.12"],"我是第一个html文件":["7.3"],"htm":["7.4"],"是一套":["7.5"],"大多数":["7.6"],"text":["7.7"],"规定元素的额外信息":["7.7"],"可在工具提示中显示":["7.7"],"class":["7.7"],"classname":["7.7"],"规定元素的类名":["7.7"],"三级标题":["7.8"],"h4":["7.8"],"四级标题":["7.8"],"h5":["7.8"],"五级标题":["7.8"],"段落":["7.9"],"paragraph":["7.9"],"要跳转的地址":["7.10"],"target":["7.10"],"blank":["7.10"],"这是一个超链接":["7.10"],"id属性":["7.10"],"这里的id属性是可以配合其它的超链接实现定位":["7.10"],"src":["7.11"],"图片的链接":["7.11"],"alt":["7.11"],"图片失效后所呈现的文字":["7.11"],"定义文档与外部资源的联系":["7.12"],"网页的标题":["7.12"],"这是文档必需的":["7.13"],"浏览器工具栏的标题":["7.13"],"用于加载脚本文件":["7.16"],"也可以在body中元素之后加载js文件":["7.16"],"description":["7.17"],"dl":["7.18"],"我是无序列表里的一项":["7.19"],"每个自定义列表项的定义以":["7.21"],"dd":["7.21"],"html":["7.21","8.2"],"提交按钮":["7.23"],"重置按钮":["7.23"],"普通按钮":["7.23"],"submit":["7.23"],"reset":["7.23"],"大部分html元素可以被分类成":["7.24"],"块级元素和行内元素":["7.24"],"块级元素":["7.24"],"amp":["7.25"],"人民币":["7.25"],"yen":["7.25"],"版权":["7.25"],"定义着重文字":["7.27"],"small":["7.27"],"定义小号字":["7.27"],"定义键盘码":["7.28"],"samp":["7.28"],"hr":["7.30"],"会出现一条分割线":["7.30"],"canvas":["8.1"],"元素":["8.1"],"用于媒介回放的":["8.1"],"video":["8.1"],"和":["8.1"],"audio":["8.1"],"对本地离线存储的更好的支持":["8.1"],"新的特殊内容元素":["8.1"],"比如":["8.1"],"article":["8.1","8.2"],"header":["8.2"],"定义了文档的头部区域":["8.2"],"nav":["8.2"],"定义导航链接的部分":["8.2"],"aside":["8.2"],"定义页面的侧边栏内容":["8.2"],"定义页面独立的内容区域":["8.2"],"但是":["8.3"],"但是要靠js脚本来绘制图形":["8.4"],"简而言之":["8.4"],"描述":["8.5"],"2d":["8.5"],"图形的语言":["8.5"],"通过":["8.5"],"javascript":["8.5"],"来绘制":["8.5"],"它只用于用户请求网站数据上":["8.6"],"它也可以存储大量的数据":["8.6"],"不影响网站的性能":["8.6"],"它可以存储整个网站的数据":["8.7"],"key":["8.8"],"value":["8.8"],"保存数据":["8.8"],"getitem":["8.8"],"main":["8.9"],"定义文档中的节":["8.9"],"section":["8.9"],"区段":["8.9"],"比如章节":["8.9"],"页眉":["8.9"],"loop":["8.11"],"则每当音频结束时重新开始播放":["8.11"],"muted":["8.11","8.12"],"视频的音频输出为静音":["8.12"],"poster":["8.12"],"url":["8.12"],"规定视频正在下载时显示的图像":["8.12"]},{"0":["2.1"],"50":["2.3"],"肯定是学习的领班人":["0.0"],"学累了":["0.0"],"一定要适当休息":["0.0"],"子元素绝对定位":["2.1"],"top":["2.1"],"right":["2.1"],"bottom":["2.1"],"50px":["2.2","2.4","2.6"],"background":["2.2","2.5"],"color":["2.2","2.5"],"8df":["2.2","2.4","2.6"],"整个实现思路如下图所示":["2.2"],"f99f78f4d54d478fa59b236c7a010a94":["2.2"],"初始位置为":["2.2"],"left":["2.3"],"translate":["2.3","2.9"],"height":["2.5","7.11"],"f40":["2.5"],"设置父元素为":["2.6"],"根据元素标签的性质":["2.7"],"可以分为":["2.7"],"多行文本父元素确认高度":["2.8"],"table":["2.9"],"cell":["2.9"],"transform":["2.9"],"x":["2.9"],"和":["3.1"],"交叉轴":["3.1"],"呈90度":["3.1"],"每条轴都有":["3.1"],"起点":["3.1"],"起点在右侧":["3.4"],"column":["3.4"],"主轴为垂直方向":["3.4"],"reverse":["3.5"],"两端对齐":["3.7"],"项目之间的间隔都相等":["3.7"],"baseline":["3.8"],"项目第一行文字的基线对齐":["3.8"],"around":["3.9"],"每根轴线两侧的间隔都相等":["3.9"],"所以":["3.9"],"轴线之间的间隔比轴线与边框的间隔大一倍":["3.9"],"属性为2":["3.12"],"其他项目都为1":["3.12"],"则前者占据的剩余空间将比其他项多一倍":["3.12"],"如果一个项目的":["3.13"],"属性为0":["3.13"],"length":["3.14"],"default":["3.14"],"的区别":["3.15"],"可以归结于":["3.15"],"flex":["3.16"],"在这里有些代码用到了html5标准的东西":["7.0"],"简称":["7.2"],"body":["7.3"],"h1":["7.3"],"我的第一个标题":["7.3"],"以上两个后缀名没有区别":["7.4"],"标记标签":["7.5"],"可以嵌套":["7.6"],"html元素可以包含其他":["7.6"],"id":["7.7"],"规定元素的唯一":["7.7"],"六级标题":["7.8"],"最小的标题":["7.8"],"warning":["7.8"],"注意":["7.8"],"标题标签只能用于标题":["7.8"],"可以把html文档分成一个个段落":["7.9"],"href属性":["7.10"],"填写要跳转的地址":["7.10"],"target属性":["7.10"],"定义被链接的文档在何处显示":["7.10"],"blank是在新的标签页打开":["7.10"],"默认是在本身标签上打开":["7.10"],"download属性":["7.10"],"width":["7.11"],"图片的宽度":["7.11"],"图片的高度":["7.11"],"设置图片的大小是个好习惯":["7.11"],"内联的样式表":["7.12"],"js脚本":["7.12"],"收藏网页时":["7.13"],"定义文档与外部资源之间的联系":["7.14"],"可以直接添加样式":["7.15"],"因为先让浏览器加载html结构和css样式":["7.16"],"定义网页的作者":["7.17"],"author":["7.17"],"我是名词":["7.21"],"表格脚注":["7.22"],"tfoot":["7.22"],"属性值":["7.22"],"border":["7.22"],"提交按钮的文字内容":["7.23"],"textarea控件":["7.23"],"textarea":["7.23"],"cols":["7.23"],"列的长度":["7.23"],"rows":["7.23"],"行的长度":["7.23"],"下拉框控件":["7.23"],"select":["7.23"],"独占一行":["7.24"],"div":["7.24"],"没有特定的含义":["7.24"],"copy":["7.25"],"注册商标":["7.25"],"reg":["7.25"],"商标":["7.25"],"sub":["7.27"],"定义下标字":["7.27"],"sup":["7.27"],"定义计算机代码样本":["7.28"],"var":["7.28"],"br":["7.30"],"footer":["8.1","8.2"],"header":["8.1"],"nav":["8.1"],"section":["8.1","8.2"],"新的表单控件":["8.1"],"calendar":["8.1"],"date":["8.1"],"time":["8.1"],"email":["8.1"],"定义":["8.2"],"或":["8.2"],"document":["8.2"],"的页脚":["8.2"],"定义文档中的节":["8.2"],"区段":["8.2"],"main":["8.2"],"像":["8.3"],"ie9":["8.3"],"这个标签是个画布":["8.4"],"图形":["8.5"],"不依赖分辨率":["8.5"],"而":["8.5"],"canvas依赖":["8.5"],"数值以":["8.6"],"键":["8.6"],"保存的数据没有时间限制":["8.7"],"也称永久存储":["8.7"],"获取数据":["8.8"],"removeitem":["8.8"],"页脚或文档中的其他部分":["8.9"],"定义独立的内容":["8.9"],"article":["8.9"],"定义页面主区域内容之外的内容":["8.9"],"则音频输出为静音":["8.11"],"preload":["8.11","8.12"],"auto":["8.11","8.12"],"直到用户点击播放按钮":["8.12"],"metadata":["8.12"],"none":["8.12"]},{"1":["7.20"],"6":["8.2"],"7":["8.2"],"danger":["0.0"],"危险":["0.0"],"早睡早起":["0.0"],"left":["2.1","7.22"],"撑满了整个父级":["2.1"],"实现水平垂直居中":["2.1"],"方块1":["2.2"],"的位置":["2.2"],"当设置left":["2.2"],"top为50":["2.2"],"的时候":["2.2"],"内部子元素为":["2.2"],"方块2":["2.2"],"设置margin为负数时":["2.2"],"将元素位移自己宽度和高度的":["2.3"],"50px":["2.3","2.5"],"background":["2.3"],"flex布局是实现水平垂直居中的最简单最快的方法":["2.4"],"flex时":["2.4"],"表示该容器内部的元素将按照flex进行布局":["2.4"],"子元素设置":["2.6"],"利用":["2.6"],"行内元素居中布局":["2.7"],"块级元素居中布局":["2.7"],"table":["2.8"],"cell":["2.8"],"vertical":["2.8"],"y":["2.9"],"flex":["2.9"],"不定高":["2.9"],"不定宽":["2.9"],"终点":["3.1"],"项目默认是沿着主轴排列":["3.1"],"可以用":["3.1"],"起点在上沿":["3.4"],"但是方向与wrap方向相反":["3.5"],"around":["3.7"],"主轴与边框的距离是项目之间距离的一半":["3.7"],"stretch":["3.8","3.9"],"默认值":["3.8"],"如果项目未设置宽高或者设为auto":["3.8"],"evenly":["3.9"],"间隔都一样":["3.9"],"integer":["3.11"],"弹性容器的宽度正好等于元素宽度总和":["3.12"],"无多余宽度":["3.12"],"此时无论":["3.12"],"其他项目都为1":["3.13"],"则空间不足时":["3.13"],"前者不缩小":["3.13"],"在容器宽度有剩余时":["3.13"],"当设置为0的是":["3.14"],"会根据内容撑开":["3.14"],"它可以设为跟":["3.14"],"或":["3.14"],"当设置为0时":["3.15"],"绝对弹性元素":["3.15"],"此时相当于告诉":["3.15"],"在伸缩的时候不需要考虑我的尺寸":["3.15"],"start":["3.16"],"end":["3.16"],"center":["3.16","7.22"],"因为html5已经是一个经典的版本":["7.0"],"html":["7.2","7.9"],"是一种用于创建网页的标准标记语言":["7.2"],"p":["7.3"],"我的第一个段落":["7.3"],"均可使用":["7.4"],"使用":["7.5"],"html文档":["7.6"],"由相互嵌套的":["7.6"],"style":["7.7"],"definition":["7.7"],"规定元素的行内样式":["7.7"],"warning":["7.7","7.25"],"注意":["7.7","7.25"],"不要仅仅为了生成粗体或大号字体而使用标题标签":["7.8"],"标题标签很重要":["7.8"],"因为用户可以通过标题快速的浏览网页":["7.8"],"应该将":["7.8"],"用作主标题":["7.8"],"最重要的":["7.8"],"这是一个段落标签":["7.9"],"跳转文件时下载":["7.10"],"在默认情况下":["7.10"],"a标签具有以下的特点":["7.10"],"鼠标悬停在链接上会变成小手":["7.10"],"一个未访问过的链接显示为蓝色字体并带有下划线":["7.10"],"访问过的链接显示为紫色并带有下划线":["7.10"],"点击链接时":["7.10"],"如果不设置就会影响页面的布局":["7.11"],"如果页面加载的图片过多":["7.11"],"不能一次性全都加载出来":["7.11"],"因为加载图片需要时间":["7.11"],"base":["7.12"],"基本的链接地址":["7.12"],"链接目标":["7.12"],"收藏夹中的标题":["7.13"],"搜索引擎结果页面的标题":["7.13"],"通常链接到外部的样式文件":["7.14"],"最后再加载js脚本":["7.16"],"这样效果会很好":["7.16"],"每30秒钟刷新当前页面":["7.17"],"http":["7.17"],"equiv":["7.17"],"refresh":["7.17"],"页面呈现的结果":["7.19","7.20"],"我来解释":["7.21"],"控制是否显示边框":["7.22"],"cellspacing":["7.22"],"控制单元格之间的间隔":["7.22"],"width":["7.22"],"表格或单元格的宽度":["7.22"],"height":["7.22"],"表格或单元格的高度":["7.22"],"align":["7.22"],"控制单元格内的文字的水平位置":["7.22"],"option":["7.23"],"selected":["7.23"],"项目1":["7.23"],"项目2":["7.23"],"行内元素":["7.24"],"不独占一行":["7.24"],"span":["7.24"],"trade":["7.25"],"虽然":["7.25"],"定义上标字":["7.27"],"ins":["7.27"],"定义插入字":["7.27"],"定义变量":["7.28"],"pre":["7.28"],"换行":["7.30"],"url":["8.1"],"search":["8.1"],"html5的骨架":["8.1"],"doctype":["8.1"],"head":["8.1"],"meta":["8.1"],"charset":["8.1"],"utf":["8.1"],"progress":["8.2"],"定义任何类型的任务的进度":["8.2"],"表单添加了新表单元素":["8.2"],"新输入类型":["8.2"],"自动验证":["8.2"],"删除了一些无用的标签":["8.2"],"以下的都不支持了":["8.3"],"js脚本是画笔":["8.4"],"具体的玩法请查阅mdn进行学习":["8.4"],"基于":["8.5"],"这意味着":["8.5"],"dom":["8.5"],"中的每个元素都是可用的":["8.5"],"值":["8.6"],"对的形式存储":["8.6"],"除非自己手动删除":["8.7"],"删除某一条数据":["8.8"],"clear":["8.8"],"清除所有数据":["8.8"],"比如侧边栏":["8.9"],"aside":["8.9"],"文档的底部区域":["8.9"],"footer":["8.9"],"带有标题的图片或其它文件":["8.9"],"metadata":["8.11"],"none":["8.11"],"规定当网页加载时":["8.11"],"音频是否默认被加载以及如何被加载":["8.11"],"src":["8.11","8.12"],"则视频在页面加载时进行加载":["8.12"],"并预备播放":["8.12"],"如果使用":["8.12"],"则忽略该属性":["8.12"]},{"3":["7.20"],"8":["8.1"],"30":["7.17"],"禁止熬夜":["0.0"],"身体是革命的本钱":["0.0"],"50px":["2.1"],"background":["2.1"],"color":["2.1","2.3"],"8df":["2.1","2.3","2.5"],"使内部子元素到":["2.2"],"方块3":["2.2"],"即中间位置":["2.2"],"这种方法不要求父元素的高度":["2.2"],"也就是即使父元素的高度变化了":["2.2"],"仍然可以保持在父元素的垂直居中位置":["2.2"],"但是该方案需要知道子元素自身的宽高":["2.2"],"可以说这种方法是":["2.3"],"margin":["2.3"],"负值的替代方案":["2.3"],"并不需要知道自身元素的宽高":["2.3"],"表示这些元素将相对于本容器水平居中":["2.4"],"也是同样的道理垂直居中":["2.4"],"grid网格布局和flex布局是一样的简单":["2.5"],"和":["2.6"],"可以让所有的行内块级元素水平垂直居中":["2.6"],"middle":["2.8","7.22"],"grid":["2.9"],"兼容性相对比较差":["2.9"],"direction":["3.1"],"属性改变":["3.1"],"起点在下沿":["3.4"],"evenly":["3.7"],"间隔都一样":["3.7"],"将沾满整个容器的高度":["3.8"],"默认值":["3.9"],"轴线占满整个交叉轴":["3.9"],"是什么值都不会生效":["3.12"],"也是不会生效的":["3.13"],"属性一样的值":["3.14"],"比如350px":["3.14"],"则项目将占据固定空间":["3.14"],"当设置为":["3.15"],"时":["3.15"],"相对弹性元素":["3.15"],"此时则需要在伸缩时将元素尺寸纳入考虑":["3.15"],"注":["3.15"],"优先使用这个值":["3.15"],"不要单独拆开写":["3.15"],"因为浏览器会推算这些值":["3.15"],"baseline":["3.16"],"来描述网页":["7.5"],"html元素构成":["7.6"],"其它的属性都是其它标签独有的":["7.7"],"也有一样的":["7.7"],"而上面的四种属性都是通用的":["7.7"],"所以等看到其它标签的时候再仔细研究这些属性":["7.7"],"其后是":["7.8"],"次重要的":["7.8"],"再其次是":["7.8"],"以此类推":["7.8"],"链接显示为红色并带有下划线":["7.10"],"warning":["7.10"],"注意":["7.10"],"这里的默认样式是可以通过后面的css样式更改":["7.10"],"a标签不能嵌套a标签":["7.10"],"所以需要图片懒加载":["7.11"],"图片链接一定要写对":["7.11"],"不然会显示裂开的图片":["7.11"],"需要了解的":["7.17"],"可以去mdn去查看":["7.17"],"页面呈现的结果":["7.21"],"right":["7.22"],"valign":["7.22"],"控制单元格内的文字的垂直位置":["7.22"],"top":["7.22"],"bottom":["7.22"],"colspan":["7.22"],"跨列合并单元格":["7.22"],"rowspan":["7.22"],"跨行合并单元格":["7.22"],"label":["7.23"],"for":["7.23"],"与表单控件的的id一致":["7.23"],"它可与表单控件相关联":["7.23"],"关联之后点击文字":["7.23"],"与之对应的表单控件会获取焦点":["7.23"],"表单控件需要嵌套在":["7.23"],"label标签中":["7.23"],"不区分大小写":["7.25"],"但实体字符对大小写敏感":["7.25"],"del":["7.27"],"定义删除字":["7.27"],"定义预格式文本":["7.28"],"title":["8.1"],"文档标题":["8.1"],"body":["8.1"],"文档内容":["8.1"],"acronym":["8.2"],"applet":["8.2"],"basefont":["8.2"],"big":["8.2"],"center":["8.2"],"dir":["8.2"],"font":["8.2"],"frame":["8.2"],"frameset":["8.2"],"noframes":["8.2"],"strike":["8.2"],"您可以为某个元素添加":["8.5"],"事件处理":["8.5"],"canvas不行":["8.5"],"详细去mdn了解":["8.5"],"该网页的数据只允许该网页访问使用":["8.6"],"index":["8.8"],"得到某个索引的key值":["8.8"],"figure":["8.9"],"经常和figure连用":["8.9"],"图片或其它文件的文字说明":["8.9"],"figcaption":["8.9"],"url":["8.11"],"规定音频文件的":["8.11"],"要播放的视频的":["8.12"],"ur":["8.12"],"width":["8.12"],"设置视频播放器的宽":["8.12"]}]'},n={"0.0":{t:"<br>\r",p:`&lt;br&gt;
&lt;br&gt;
&lt;br&gt;
&lt;br&gt;
::: tip 你可以的
不能盲目学习，也要掌握技巧
相信自己，超越自己
:::
::: warning 警告
 ...`,l:"index.html",a:"br"},"1.0":{t:":::info 我的知识库搭建过程",p:`这里可以看到我的知识库搭建的过程，如果你也想要搭建一个属于你自己的知识库，这里会有你的答案
:::
`,l:"notebuild/index.html",a:"info-我的知识库搭建过程"},"2.0":{t:"# 元素的水平垂直居中\r",p:"\r",l:"web-study/interview/001.html",a:"元素的水平垂直居中"},"2.1":{t:"定位 + margin: auto\r",p:`&lt;html&gt;
    &lt;title&gt;&lt;/title&gt;
    &lt;body&gt;
        &lt;div class='father'&gt;
    ...`,l:"web-study/interview/001.html#定位-margin-auto",a:"定位-margin-auto"},"2.2":{t:"定位 + margin：负值\r",p:`&lt;html&gt;
    &lt;title&gt;&lt;/title&gt;
    &lt;body&gt;
        &lt;div class='father'&gt;
    ...`,l:"web-study/interview/001.html#定位-margin-负值",a:"定位-margin-负值"},"2.3":{t:"定位 + transform\r",p:`&lt;html&gt;
    &lt;title&gt;&lt;/title&gt;
    &lt;body&gt;
        &lt;div class='father'&gt;
    ...`,l:"web-study/interview/001.html#定位-transform",a:"定位-transform"},"2.4":{t:"flex弹性布局\r",p:`&lt;html&gt;
    &lt;title&gt;&lt;/title&gt;
    &lt;body&gt;
        &lt;div class='father'&gt;
    ...`,l:"web-study/interview/001.html#flex弹性布局",a:"flex弹性布局"},"2.5":{t:"grid网格布局\r",p:`&lt;html&gt;
    &lt;title&gt;&lt;/title&gt;
    &lt;body&gt;
        &lt;div class='father'&gt;
    ...`,l:"web-study/interview/001.html#grid网格布局",a:"grid网格布局"},"2.6":{t:"table布局\r",p:`&lt;html&gt;
    &lt;title&gt;&lt;/title&gt;
    &lt;body&gt;
        &lt;div class='father'&gt;
    ...`,l:"web-study/interview/001.html#table布局",a:"table布局"},"2.7":{t:"总结\r",p:`
上述方法中，不知道元素宽高大小仍能实现水平垂直居中的方法有：

利用定位 + margin:auto
利用定位 + transform
flex布局
grid布局


根据元素标签的性质，可以分为： ...`,l:"web-study/interview/001.html#总结",a:"总结"},"2.8":{t:"元素居中布局\r",p:`
水平居中

行内元素可设置：text-align: center
flex布局设置父元素：display: flex; justify-content: center

垂直居中

单行文本父元素确 ...`,l:"web-study/interview/001.html#元素居中布局",a:"元素居中布局"},"2.9":{t:"块级元素居中布局\r",p:`
水平居中

定宽: margin: 0 auto
绝对定位+left:50% + margin:负自身一半

垂直居中

position: absolute设置 left、top、margin-l ...`,l:"web-study/interview/001.html#块级元素居中布局",a:"块级元素居中布局"},"3.0":{t:"# flex布局\r",p:"\r",l:"web-study/interview/002.html",a:"flex布局"},"3.1":{t:"什么是flex布局\r",p:`
Flexible Box 简称 flex
弹性布局， 可以简便、完整、响应式地实现各种页面布局


采用Flex布局的元素，称为 flex 容器 [container]
它的所有子元素自动成为容器成 ...`,l:"web-study/interview/002.html#什么是flex布局",a:"什么是flex布局"},"3.2":{t:"属性\r",p:`flex常见的属性可分为两种：

容器属性
容器成员属性

`,l:"web-study/interview/002.html#属性",a:"属性"},"3.3":{t:"容器属性\r",p:"\r",l:"web-study/interview/002.html#容器属性",a:"容器属性"},"3.4":{t:"flex-direction\r",p:`
决定主轴的方向,就是项目的排列方向


flex-direction

row (默认值):      主轴为水平方向，起点在左侧
row-reverse:      主轴为水平方向，起点在右侧
c ...`,l:"web-study/interview/002.html#flex-direction",a:"flex-direction"},"3.5":{t:"flex-wrap\r",p:`
决定容器中的项目是否换行


flex-wrap

nowrap (默认值)：   不换行
wrap：             换行
wrap-reverse：      换行，但是方向与wrap方 ...`,l:"web-study/interview/002.html#flex-wrap",a:"flex-wrap"},"3.6":{t:"flex-flow\r",p:`
这是flex-direction 与 flex-wrap的简写


flex-flow: [flex-direction] || [flex-wrap]

`,l:"web-study/interview/002.html#flex-flow",a:"flex-flow"},"3.7":{t:"justify-content\r",p:`
决定了项目在主轴上的对齐方式


justify-content

flex-start(默认值):    左对齐
flex-end:            右对齐
center:          ...`,l:"web-study/interview/002.html#justify-content",a:"justify-content"},"3.8":{t:"align-items\r",p:`
决定了项目在交叉轴上的对齐方式


align-items

flex-start:            交叉轴的起点对齐
flex-end:      交叉轴的终点对齐
center:      ...`,l:"web-study/interview/002.html#align-items",a:"align-items"},"3.9":{t:"align-content\r",p:`
决定了多条轴线的对齐方式，如果项目只有一条轴线，那这个属性不起作用


align-content

flex-start:            与交叉轴的起点对齐
flex-end:       ...`,l:"web-study/interview/002.html#align-content",a:"align-content"},"3.10":{t:"容器成员属性\r",p:"\r",l:"web-study/interview/002.html#容器成员属性",a:"容器成员属性"},"3.11":{t:"order\r",p:`
定义项目的排列顺序。数值越小，排列越靠前，默认为0

.item {
    order: &lt;integer&gt;;
}

`,l:"web-study/interview/002.html#order",a:"order"},"3.12":{t:"flex-grow\r",p:`
定义项目的放大比例（容器宽度&gt;元素总宽度时如何伸展）


默认为0，即如果存在剩余空间，也不放大
如果所有项目的flex-grow属性都为1，则它们将等分剩余空间（如果有的话）
如果一个项目的 ...`,l:"web-study/interview/002.html#flex-grow",a:"flex-grow"},"3.13":{t:"flex-shrink\r",p:`
定义了项目的缩小比例（容器宽度&lt;元素总宽度时如何收缩）


默认为1，即如果空间不足，该项目将缩小

.item {
    flex-shrink: &lt;number&gt;; /def ...`,l:"web-study/interview/002.html#flex-shrink",a:"flex-shrink"},"3.14":{t:"flex-basis\r",p:`
设置的是元素在主轴上的初始尺寸
初始尺寸是元素在 flex-grow 和 flex-shrink 生效前的尺寸


浏览器根据这个属性，计算主轴是否有多余空间，默认值为auto，即项目的本来大小，如 ...`,l:"web-study/interview/002.html#flex-basis",a:"flex-basis"},"3.15":{t:"flex\r",p:`
flex属性是flex-grow, flex-shrink 和 flex-basis的简写，默认值为0 1 auto，也是比较难懂的一个复合属性

.item {
  flex: none | [  ...`,l:"web-study/interview/002.html#flex",a:"flex"},"3.16":{t:"align-self\r",p:`
允许单个项目有与其他项目不一样的对齐方式   可以覆盖align-items属性


默认值为auto，表示继承父元素的align-items属性，如果没有父元素，则等同于stretch

.ite ...`,l:"web-study/interview/002.html#align-self",a:"align-self"},"3.17":{t:"应用场景\r",p:`元素水平垂直居中
三栏两栏布局
移动端、小程序都建议使用flex弹性布局
`,l:"web-study/interview/002.html#应用场景",a:"应用场景"},"4.0":{t:":::tip 提示",p:`这是一些面试题
:::
`,l:"web-study/interview/index.html",a:"tip-提示"},"7.0":{t:"# html4\r",p:`:::warning 开始之前你要明白
html4 是 html5标准还没有发布之前所有的标准的统称（自己的理解）
在这里有些代码用到了html5标准的东西，因为html5已经是一个经典的版本
::: ...`,l:"web-study/studynotes/htmlnotes/html01.html",a:"html4"},"7.1":{t:"1.什么是html\r",p:"\r",l:"web-study/studynotes/htmlnotes/html01.html#_1-什么是html",a:"_1-什么是html"},"7.2":{t:"1.1-定义\r",p:`
超文本标记语言（英语：HyperText Markup Language，简称：HTML）
是一种用于创建网页的标准标记语言。

`,l:"web-study/studynotes/htmlnotes/html01.html#_1-1-定义",a:"_1-1-定义"},"7.3":{t:"1.2-html 的基本骨架\r",p:`&lt;!DOCTYPE html&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;meta charset=&quot;utf-8&quot;&gt;
    &lt ...`,l:"web-study/studynotes/htmlnotes/html01.html#_1-2-html-的基本骨架",a:"_1-2-html-的基本骨架"},"7.4":{t:"1.3-后缀名\r",p:`
.html
.htm

以上两个后缀名没有区别，均可使用
`,l:"web-study/studynotes/htmlnotes/html01.html#_1-3-后缀名",a:"_1-3-后缀名"},"7.5":{t:"1.4-总结\r",p:`
HTML 不是一种编程语言，而是一种标记语言
标记语言 是一套标记标签
HTML 使用标记标签来描述网页

`,l:"web-study/studynotes/htmlnotes/html01.html#_1-4-总结",a:"_1-4-总结"},"7.6":{t:"2.Html元素\r",p:`::: tip html元素
指的是从 [开放标签] 到 [结束标签] 的所有代码
:::

大多数 HTML元素 可以嵌套（HTML元素可以包含其他 HTML元素）
HTML文档 由相互嵌套的 HT ...`,l:"web-study/studynotes/htmlnotes/html01.html#_2-html元素",a:"_2-html元素"},"7.7":{t:"3.Html属性\r",p:`:::tip 属性
是为元素提供附属信息的
:::

html标签 是可以书写属性的
但是属性是要写在开放标签上的
属性的写法，主要都是 以 “属性名='属性值'” 的形式书写
有一些属性是所有 ht ...`,l:"web-study/studynotes/htmlnotes/html01.html#_3-html属性",a:"_3-html属性"},"7.8":{t:"4.标题标签[h1~h6]\r",p:`:::info 分类:
· 它属于排版标签
· 双标签
· 块级元素
:::
:::tip 标题(header)
标题标签 有六种 分别有 h1~h6
从定义上讲，h1是最大的标题，h6是最小的
:: ...`,l:"web-study/studynotes/htmlnotes/html01.html#_4-标题标签-h1-h6",a:"_4-标题标签-h1-h6"},"7.9":{t:"5.段落标签[p]\r",p:`:::info 分类:
· 它属于排版标签
· 双标签
· 块级元素
:::
:::tip 段落(paragraph)
段落标签 p 可以把html文档分成一个个段落
:::
&lt;p&gt;这是一 ...`,l:"web-study/studynotes/htmlnotes/html01.html#_5-段落标签-p",a:"_5-段落标签-p"},"7.10":{t:"6.链接标签[a]\r",p:`:::info 分类:
· 它属于链接标签
· 双标签
· 行内元素
:::
:::tip 超链接(链接)
使用标签 a 来设置超文本链接
超链接可以是一个字、一个词、一张图......
点击它可以跳 ...`,l:"web-study/studynotes/htmlnotes/html01.html#_6-链接标签-a",a:"_6-链接标签-a"},"7.11":{t:"7.图像标签[img]\r",p:`:::info 分类:
· 它属于图像标签
· 行内块元素
· 单标签
:::
::: tip 图像标签
这个标签可以在页面上显示图片
img 是空标签，他没有结束标签
它是靠属性来操作标签
:::
 ...`,l:"web-study/studynotes/htmlnotes/html01.html#_7-图像标签-img",a:"_7-图像标签-img"},"7.12":{t:"8.Html文档[head标签]\r",p:`:::tip head标签
它包含了所有头部标签元素
&lt;head&gt;
 &lt;meta /&gt; 网页的元信息
 &lt;link /&gt; 定义文档与外部资源的联系
 &lt;tit ...`,l:"web-study/studynotes/htmlnotes/html01.html#_8-html文档-head标签",a:"_8-html文档-head标签"},"7.13":{t:"8.1-title标签\r",p:`:::tip title标签
定义网页的标题
这是文档必需的
:::

浏览器工具栏的标题
收藏网页时，收藏夹中的标题
搜索引擎结果页面的标题

`,l:"web-study/studynotes/htmlnotes/html01.html#_8-1-title标签",a:"_8-1-title标签"},"7.14":{t:"8.2-link标签\r",p:`:::tip link标签
定义文档与外部资源之间的联系
通常链接到外部的样式文件
:::
`,l:"web-study/studynotes/htmlnotes/html01.html#_8-2-link标签",a:"_8-2-link标签"},"7.15":{t:"8.3-style标签\r",p:`:::tip style标签
可以直接添加样式
:::
`,l:"web-study/studynotes/htmlnotes/html01.html#_8-3-style标签",a:"_8-3-style标签"},"7.16":{t:"8.4-script标签\r",p:`:::tip script标签
用于加载脚本文件
也可以在body中元素之后加载js文件
因为先让浏览器加载html结构和css样式，最后再加载js脚本，这样效果会很好
:::
`,l:"web-study/studynotes/htmlnotes/html01.html#_8-4-script标签",a:"_8-4-script标签"},"7.17":{t:"8.5-meta标签\r",p:`:::tip meta标签
定义网页的元信息，它不会显示在网页中，但会被浏览器解析
通常用于指定网页的描述，关键词，文件的最后修改时间，作者，和其他元数据
:::
搜索引擎的关键词
&lt;meta  ...`,l:"web-study/studynotes/htmlnotes/html01.html#_8-5-meta标签",a:"_8-5-meta标签"},"7.18":{t:"9.列表标签[ul,ol,dl]\r",p:"\r",l:"web-study/studynotes/htmlnotes/html01.html#_9-列表标签-ul-ol-dl",a:"_9-列表标签-ul-ol-dl"},"7.19":{t:"9.1-无序列表标签[ul]\r",p:`:::tip 无序列表[ul]
一个项目的列表，此列项目使用粗体圆点（典型的小黑圆圈）进行标记
:::
&lt;ul&gt;
 &lt;li&gt;我是无序列表里的一项&lt;/li&gt;
     ...`,l:"web-study/studynotes/htmlnotes/html01.html#_9-1-无序列表标签-ul",a:"_9-1-无序列表标签-ul"},"7.20":{t:"9.2-有序列表标签[ol]\r",p:`:::tip 有序列表[ol]
一个项目的列表，此列项目使用 数字 进行标记
:::
&lt;ol&gt;
   &lt;li&gt;我是有序列表里的一项&lt;/li&gt;
    &lt;li& ...`,l:"web-study/studynotes/htmlnotes/html01.html#_9-2-有序列表标签-ol",a:"_9-2-有序列表标签-ol"},"7.21":{t:"9.3-自定义列表标签[dl]\r",p:`:::tip 自定义列表[dl]
自定义列表不仅仅是一列项目，而是项目及其注释的组合。
自定义列表以 dl 标签开始。每个自定义列表项以 dt 开始。每个自定义列表项的定义以 dd 开始。
:::
& ...`,l:"web-study/studynotes/htmlnotes/html01.html#_9-3-自定义列表标签-dl",a:"_9-3-自定义列表标签-dl"},"7.22":{t:"10.表格标签[table]\r",p:`:::tip 表格标签[table]
table标签可以用来创建表格
每个表格都有若干行，使用 tr 标签来定义
每行都被分割成若干个单元格，使用 td 标签来定义
td 是table data 的缩 ...`,l:"web-study/studynotes/htmlnotes/html01.html#_10-表格标签-table",a:"_10-表格标签-table"},"7.23":{t:"11.表单标签[form]\r",p:`:::tip 表单标签[form]
form标签用来收集用户的输入信息
文档中有一块区域，里面有表单控件，收集用户输入的信息，并提交到对应的web服务器上
:::
基本骨架
&lt;form acti ...`,l:"web-study/studynotes/htmlnotes/html01.html#_11-表单标签-form",a:"_11-表单标签-form"},"7.24":{t:"12.Html区块元素\r",p:`html 可以通过 div标签 和 span标签 将元素组合起来
:::tip  区块元素
大部分html元素可以被分类成 块级元素和行内元素
块级元素：独占一行
div 没有特定的含义
行内元素：不 ...`,l:"web-study/studynotes/htmlnotes/html01.html#_12-html区块元素",a:"_12-html区块元素"},"7.25":{t:"13.Html字符实体\r",p:`:::tip 字符实体
HTML 中的预留字符必须被替换为字符实体。
一些在键盘上找不到的字符也可以使用字符实体来替换。
:::
空格    空格    &amp;nbsp;
&lt;      小于 ...`,l:"web-study/studynotes/htmlnotes/html01.html#_13-html字符实体",a:"_13-html字符实体"},"7.26":{t:"14.Html 格式化标签\r",p:"\r",l:"web-study/studynotes/htmlnotes/html01.html#_14-html-格式化标签",a:"_14-html-格式化标签"},"7.27":{t:"14.1-文本格式化标签\r",p:`


标签
描述




b
定义粗体文本


i
定义斜体字


strong
定义加重语气


em
定义着重文字


small
定义小号字


sub
定义下标字


sup
定义上标字


 ...`,l:"web-study/studynotes/htmlnotes/html01.html#_14-1-文本格式化标签",a:"_14-1-文本格式化标签"},"7.28":{t:'14.2-"计算机输出"标签\r',p:`


code
定义计算机代码




kbd
定义键盘码


samp
定义计算机代码样本


var
定义变量


pre
定义预格式文本



`,l:"web-study/studynotes/htmlnotes/html01.html#_14-2-计算机输出-标签",a:"_14-2-计算机输出-标签"},"7.29":{t:"15.其它\r",p:"\r",l:"web-study/studynotes/htmlnotes/html01.html#_15-其它",a:"_15-其它"},"7.30":{t:"15.1-还有一些标签\r",p:`&lt;hr /&gt;   会出现一条分割线
&lt;br /&gt;   换行

`,l:"web-study/studynotes/htmlnotes/html01.html#_15-1-还有一些标签",a:"_15-1-还有一些标签"},"8.0":{t:"# html5",p:"",l:"web-study/studynotes/htmlnotes/html02.html",a:"html5"},"8.1":{t:"1.什么是html5",p:`:::warning 注意
HTML5是HTML最新的修订版本，2014年10月由万维网联盟（W3C）完成标准制定。
HTML5的设计目的是为了在移动设备上支持多媒体。
:::
:::tip html ...`,l:"web-study/studynotes/htmlnotes/html02.html#_1-什么是html5",a:"_1-什么是html5"},"8.2":{t:"2.html5相比于html4多了哪些东西",p:`
1.html5 支持多媒体

video 视频
audio 音频

2.html5 支持开发应用

XHTMLHttpRequest 2
本地数据存储
访问本地文件
本地 SQL 数据
缓存引用
J ...`,l:"web-study/studynotes/htmlnotes/html02.html#_2-html5相比于html4多了哪些东西",a:"_2-html5相比于html4多了哪些东西"},"8.3":{t:"3.浏览器的支持",p:`:::warning html5对于浏览器的支持
对于现在大部分的浏览器都得到很好的支持
但是 像 IE9 以下的都不支持了
:::
`,l:"web-study/studynotes/htmlnotes/html02.html#_3-浏览器的支持",a:"_3-浏览器的支持"},"8.4":{t:"4.canvas标签",p:`:::tip canvas标签
定义图形的，但是要靠js脚本来绘制图形
简而言之，这个标签是个画布，js脚本是画笔
具体的玩法请查阅mdn进行学习
:::
`,l:"web-study/studynotes/htmlnotes/html02.html#_4-canvas标签",a:"_4-canvas标签"},"8.5":{t:"5.SVG矢量图",p:`:::tip SVG矢量图
可以使用svg标签定义可缩放矢量图形
:::

优势:

SVG 图像可通过文本编辑器来创建和修改
SVG 图像可被搜索、索引、脚本化或压缩
SVG 是可伸缩的
SVG 图 ...`,l:"web-study/studynotes/htmlnotes/html02.html#_5-svg矢量图",a:"_5-svg矢量图"},"8.6":{t:"6.本地数据存储",p:`:::info html5 存储
早期的时候浏览器是通过cookie来存储数据的
但是web存储要求更安全更快速，这些数据不会存在服务器上，它只用于用户请求网站数据上
它也可以存储大量的数据，不影响网 ...`,l:"web-study/studynotes/htmlnotes/html02.html#_6-本地数据存储",a:"_6-本地数据存储"},"8.7":{t:"6.1-localStorage",p:`:::tip localStorage存储
它可以存储整个网站的数据
保存的数据没有时间限制，也称永久存储
除非自己手动删除
:::
`,l:"web-study/studynotes/htmlnotes/html02.html#_6-1-localstorage",a:"_6-1-localstorage"},"8.8":{t:"6.2-sessionstorage",p:`:::tip sessionStorage存储
它可以临时存储同一窗口或者(同一标签页)的数据
如果窗口或者(标签页)关闭时，数据也会随之删除
:::

不管是localStorage,还是sessi ...`,l:"web-study/studynotes/htmlnotes/html02.html#_6-2-sessionstorage",a:"_6-2-sessionstorage"},"8.9":{t:"7.语义化标签",p:`:::tip 语义化标签
顾名思义，就是有语义的标签
它能够告诉开发者和浏览器，这个标签所表示的含义
div 和 span 标签 就是无语义
form、table、img等 就是有语义的
html5  ...`,l:"web-study/studynotes/htmlnotes/html02.html#_7-语义化标签",a:"_7-语义化标签"},"8.10":{t:"8.媒体标签",p:"",l:"web-study/studynotes/htmlnotes/html02.html#_8-媒体标签",a:"_8-媒体标签"},"8.11":{t:"8.1-audio标签",p:`
定义声音 音乐或其他音频流
目前这个标签仅支持 MP3、Wav、Ogg




autoplay
autoplay
如果出现该属性，则音频在就绪后马上播放




controls
controls ...`,l:"web-study/studynotes/htmlnotes/html02.html#_8-1-audio标签",a:"_8-1-audio标签"},"8.12":{t:"8.2-video标签",p:`
定义视频 电影片段或其他视频流
支持三种视频格式：MP4、WebM、Ogg




autoplay
autoplay
如果出现该属性，则视频在就绪后马上播放




controls
contro ...`,l:"web-study/studynotes/htmlnotes/html02.html#_8-2-video标签",a:"_8-2-video标签"},"8.13":{t:"9.新增表单控件",p:"",l:"web-study/studynotes/htmlnotes/html02.html#_9-新增表单控件",a:"_9-新增表单控件"},"9.0":{t:":::tip 指引一下",p:`这是我学习前端的学习笔记
:::
`,l:"web-study/studynotes/index.html",a:"tip-指引一下"}},l={previewLength:100,buttonLabel:"搜索",placeholder:"请输入关键词",allow:[],ignore:[]},e={INDEX_DATA:t,PREVIEW_LOOKUP:n,Options:l};export{e as default};
